[
  {
    "company": "Astranis Space Technologies",
    "title": "Summer Intern, Software Engineer. Remote",
    "company_url": "https://www.linkedin.com/company/astranis?trk=public_jobs_topcard-org-name",
    "location": "San Francisco, CA",
    "details": "Astranis is connecting the four billion people in the world who do not currently have access to the internet. We are building the next generation of smaller, lower-cost spacecraft to bring the world online.\nWe are well-funded by some of the best investors in the business and have raised over $350 million to date. We are have a world-class team that is passionate about building amazing technology. And we have a fun and collaborative work environment where you will learn a lot and make a huge impact no matter where you are in your career. Just check out our Glassdoor reviews to see what our team has to say about working at Astranis.\nOur team is growing fast. Apply to be a part of our mission to connect the world!\nInternships at Astranis typically last for twelve weeks, and are hourly roles designed for students who are currently enrolled at a four-year university.\nAs an Intern, you will have an amazing opportunity to work on hard problems — we pride ourselves on giving everyone at Astranis a chance to do meaningful work on challenging projects, no matter their seniority. Many past interns have designed and tested hardware/software that is heading to space on our first satellite, and many of them are now full-time employees at Astranis.\nIf you have already graduated from a four-year university, please apply to be an Associate Engineer.\nRole\nDesign, build, and implement the ground software system for our spacecraft\nUse React to build the front end interface to our web application that enables safe, efficient, and elegant command and control of our satellite throughout its mission\nUse Django to build the backend for our commanding interface\nWork closely with satellite operators to understand how they would like to operate the spacecraft to inform software requirements\nCollaborate with multidisciplinary teams to define software requirements, architectures, and designs\nRequirements\nCurrently pursuing a B.S. or M.S. in Computer Science or equivalent technical degree\nObject-oriented: Python or other\nDemonstrated ability to design, write, and test software from scratch\nDon't meet them all? Not a problem. Please apply even if you do not meet all these criteria.\nBonus\nDatabase: SQL, NoSQL\nExperience with tools like Docker and load balancers for cloud resource provisioning, deployment, and management\nInter process communication\nU.S. Citizenship, Lawful Permanent Residency, Or Refugee/Asylee Status Required\n(To comply with U.S. Government space technology export regulations, applicant must be a U.S. citizen, lawful permanent resident of the United States, or other protected individual as defined by 8 U.S.C. 1324b(a)(3))\nOur mission and our products are meant to connect the world and everyone in it, regardless of gender, race, creed, or any other distinction. We believe in a diverse and inclusive workplace, and we encourage all people to join our team and bring their unique perspective to help make us stronger."
  },
  {
    "company": "PeachPay: One-Click Checkout",
    "title": "Python Developer Intern. In-Person",
    "company_url": "https://www.linkedin.com/company/peachpay?trk=public_jobs_topcard-org-name",
    "location": "Ames, IA",
    "details": "About PeachPay\nPeachPay is a technology startup on a mission to supercharge ecommerce checkout and payments. We bring a sleek, modern checkout experience to ecommerce stores, increasing their sales and making it easier for customers to buy their favorite items. Think Amazon-style shopping, including the famous one-click checkout, but for a network of ecommerce merchants who previously could not compete with the frictionless shopping experience of Amazon.\nFounded in 2020, with a product launch in 2021, we're growing quickly and looking to expand our team.\nPeachPay has secured funding from a number of investors, including former founders in the ecommerce space, the company behind WordPress, and top venture capital firms.\nEngineering at PeachPay\nOur engineers work across the stack on a variety of projects. We look for people who are willing to learn new things daily, ask questions that guide our product direction, and take ownership of engineering projects from start to finish. Technologies we use include TypeScript, Node.js, and MongoDB, but it’s okay if you haven’t used these before. We believe that solid engineering fundamentals provide more value in the long run than trivia about current frameworks.\nRequirements\nAn appreciation for working in a fast-paced environment and building products from ground zero\nExperience being a generalist and working on both the frontend, backend, and doing anything it takes to solve problems and delight users both internally and externally\nA tendency to thrive in a collaborative environment involving different stakeholders and subject matter experts\nPride in working on projects to successful completion involving a wide variety of technologies and systems\nA knack for stitching together many different services and processes even if they have not worked with them before\nEmpathy for users and the ability to craft great experiences\nEnjoyment working with a diverse group of people with different areas of expertise\nThe ability to uphold best practices in engineering, security, and design\nBenefits\nAlthough we're still growing, we can offer some real perks that actually help your career.\nHave a big impact — know the results of your work right away. Whether it's a new marketing campaign, product feature, or partnership strategy, our feedback loop is short.\nLearn a lot — you will be expected to figure things out and take action.\nWork on your own schedule — some people work best at 3 in the morning, and that's okay.\nBe judged by your work, not fancy credentials.\nFor those in office: unlimited free food, and a PS5 for those who like gaming!"
  },
  {
    "company": "Udemy",
    "title": "Software Development Engineer. Remote",
    "company_url": "https://www.linkedin.com/company/udemy?trk=public_jobs_topcard-org-name",
    "location": "San Francisco, CA",
    "details": "About Udemy\nUdemy is the world’s largest education platform with more than 30 million monthly visitors. Through our Consumer and Enterprise businesses, Udemy creates new possibilities for people and organizations everywhere by connecting them to the knowledge and skills they need to succeed in a changing world.\nThe Udemy consumer marketplace offers thousands of up-to-date courses in dozens of languages and provides the tools learners and instructors need to achieve their goals and reach their full potential.\nFor companies, Udemy Business (UB) offers an employee training and development platform with subscription access to thousands of courses, learning analytics, as well as the ability to host and distribute their own content. Our enterprise platform is among the fastest growing SaaS businesses in the world. UB has more than 10,000 customers and serves the majority of the Fortune 100.\nWe are proud to be recognized for our world class employee experience:\nBusiness Insider SF: Best Places to Work Bay Area\nBuilt In Colorado: Best Places to Work\nBest Workplaces (Great Place to Work List): #1 in Turkey\nCertified Best Place to Work: Dublin\nFortune: Change the World Company\nUdemy is headquartered in San Francisco with hubs in Ankara, Turkey; Austin, Texas; Boston, Massachusetts; Mountain View, California; Denver, Colorado; Dublin, Ireland; Melbourne, Australia; New Delhi, India; and Sao Paulo, Brazil.\nVaccine Mandate (US Only)\nUdemy is committed to keeping its employees, clients, and communities safe. Accordingly, we require all U.S. employees to be fully vaccinated against COVID-19 if their work requires them to come into a Udemy office or come into close contact with others. If you are unable to get vaccinated due to a medical condition, disability, sincerely-held religious belief, or as otherwise required by applicable law, we will consider requests for accommodation.\nInformation regarding data privacy is available within the Udemy Careers Privacy Notice .\nAbout The Role:\nUdemy is looking for a software engineer intern to join the Data Platform team for the summer. As a member of the team, you will be responsible for a variety of software development projects ranging from scaling the data infrastructure to setting up new internal data services/products to building and expanding frameworks that enable others to easily develop data pipelines. The ideal candidate is a motivated self-starter with a passion for building software that meaningfully improves the lives of people around the world!\nResponsibilities:\nBuild and integrate scalable backend systems, services, platforms, and tools\nCollaborate with data scientists and engineers to solve complex data problems at scale\nIdentify and evaluate new technologies that improve performance, maintainability and elegance of our infrastructure\nContribute to a team culture that values inclusiveness and quality while fostering innovation\nQualifications:\nStrong knowledge of computer science fundamentals, including object-oriented design, data structures, and algorithms\nProficient with a programming language, such as Python, Java, or Scala\nSelf-driven, highly motivated, and able to learn quickly\nExcellent written and oral communication skills\nIdeally graduating in 2022\nPreferred, but not required:\nFamiliarity with design and development of large-scale platforms and services\nFamiliarity with data processing frameworks and tools such as Spark, Hadoop, Hive, and Kafka\nFamiliarity with databases such as MySQL and Redshift\nFamiliarity with infrastructure as code tools such as Terraform, Ansible, and Packer\nFamiliarity with developing end-to-end data pipelines\nThe length of this internship will be between 7-13 weeks."
  },
  {
    "company": "Stripe",
    "title": "Software Engineer Intern. Remote",
    "company_url": "https://www.linkedin.com/company/stripe?trk=public_jobs_topcard-org-name",
    "location": "United States",
    "details": "We’re looking for a software engineer to join a new team focused on building world class internal documentation systems.\nStripe’s engineering org is scaling quickly. To support that growth we must implement thoughtful and flexible internal documentation systems and tools that enable engineers to write, find, and consume docs quickly and confidently. This team will lay the groundwork for how Stripe engineers get things done over the next ten years.\nYou Will\nSolve challenging product and infrastructure problems that enable our internal documentation to grow and scale with our engineering org\nDevelop a deep understanding of our internal users and how they get engineering work done\nBuild and improve the backend tools and systems that enable engineers to produce and maintain high-quality, accurate documentation cheaply and easily\nDesign and implement new tools and interfaces for writing and consuming technical documentation\nBuild and maintain a system that allows for fast search and discovery of existing documentation\nYou may be a fit for this role if you:\nHave a passion for developer productivity and great documentation\nHave 3+ years of Software Engineering experience\nHave hands-on experience building developer tools\nEnjoy working across the stack—on frontend, backend, infrastructure, or data pipelines—to solve complex problems and delight our users (you don’t need to be an expert in all of these, but it helps to be interested in learning about them)\nTake pride in shepherding projects from ideation to completion, often requiring partnership with stakeholder teams to carefully roll out changes\nSeek out feedback from your users and empathetically advocate for them throughout the development process\nWhat’s it like to work at Stripe?\nStripe is helping the internet fulfill its potential as a platform for economic progress by building software tools that accelerate global economic access and technological development. Stripe makes it easy to start, run, and scale an internet business from anywhere in the world. We look at Stripe as a constant work in progress and the same is true of our people; for all of us, we believe the best is yet to come. We’re here to support each other in our curiosity and creativity – which we pursue through thoughtful discussion and knowledge-sharing among a diverse set of peers and colleagues. We want to work in a company of warm, inclusive people who treat their colleagues exceptionally well. The kind of people who are committed to going out of their way to help other Stripes in the short-term and pushing them to improve over the long-term (by helping them to get better at what they do). We’re a highly cross-functional organization and view that as part of the fun: we design our space to encourage as much collaboration as possible. We have long tables in the kitchen for a reason (to enable everyone to meet new people and learn from them). We also have a culture of transparency that we carry through to email communication, ensuring that Stripes all around the world have the information they need to make good local decisions. In both our products and our people, we aim to reflect, represent and advocate for all of our users, globally. Our users transcend geography, culture and language; what we share, collectively, is a drive to create a fairer, more economically interconnected world."
  },
  {
    "company": "Proofpoint",
    "title": "Software Engineer Internship",
    "company_url": "https://www.linkedin.com/company/proofpoint?trk=public_jobs_topcard-org-name",
    "location": "San Francisco, CA",
    "details": "It's fun to work in a company where people truly BELIEVE in what they're doing!\nWe're committed to bringing passion and customer focus to the business.\nThe Role\nThe high-performance Cloudmark Security Platform is used by service providers to stop spam, viruses, phishing, and other messaging threats. Our team determines how to test the new features and functions we add to the system; we find bugs before our customers or threat actors do. We work in close collaboration with developers, product management, and customer support to understand customer needs and ensure our software meets customer expectations.\nYou will work on the automated testing system that drives our performance and regression testing. You’ll have the opportunity to build skills with python, shell scripting, and Linux systems. You’ll gain experience in testing software through building software. This is an exciting opportunity where you’ll think about how to break systems and improve them! The work you do in your internship will result in improvements to the systems we use to test the Cloudmark Security Platform and will help our customers stop spam!\nJob Requirements\nExcellent communications skills, both written and verbal\nIntellectual curiosity and tenacity – you wonder why things work (or don’t!) and want to figure them out\nFamiliarity with Linux\nFamiliarity with programming in python, Golang, C, or similar systems programming languages\nCandidate Profile\nYou have the ability and interest in working part time (a maximum of 30 hours/week) in our San Francisco, CA office or remotely until it is safe to work in office. You are currently pursuing an undergraduate degree, and are maintaining an above average GPA. This internship is scheduled to start immediately and run though the end of August 2022.\nIf you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!"
  },
  {
    "company": "Ekata, a Mastercard company",
    "title": "Software Engineer Intern. Remote",
    "company_url": "https://www.linkedin.com/company/ekataglobal?trk=public_jobs_topcard-org-name",
    "location": "Seattle, WA",
    "details": "Description\nOur Purpose\nWe work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion (https//www.mastercard.us/en-us/vision/who-we-are/diversity-inclusion.html) for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nOverview\nThe Cyber and Intelligence Solutions (C&I) team is responsible for product management and innovative product development of products and services to address the evolving risk & cyber security needs of all of MasterCard’s various customer segments. The C&I team was established with the responsibility to safeguard all aspects of safety and security in payments and have made great strides with new products, services and standards, positively impacting all aspects of our current and future payment eco-system.\nEkata, a Mastercard company, is the global standard in identity verification, providing businesses worldwide the ability to link any digital transaction to the human behind it. Our Ekata Identity Engine, the first and only of its kind, uses complex machine learning to combine features derived from the billions of transactions within our proprietary network and the data from our graph to deliver industry leading risk assessment solutions.\nWe are looking for a Software Engineering Intern to work in our Seattle office, who thrives on designing, coding, and maintaining high-performance data processing applications on the JVM platform (primarily in Clojure and Scala), running on AWS.\nYour ideal internship should be one where you work in a small team and are empowered to make yourself and your team more productive on a daily basis. You should want to be part of a team where your desire to grow and learn are valued and aptly rewarded; where using and contributing to open source are looked upon as an asset; where innovating and executing are core to your teams' beliefs.\nIn This Role You Will\nWrite performant code and write automated test to validate correctness of code\nDevelop and deploy large-scale microservices and/or data processing systems\nMeet development milestones and business requirements on schedule\nIndependently analyze, propose and develop solutions for technical problems and issues\nEnsure the adherence to the standards and procedures that result in an environment compliant with information security policy\nAll About You\nA willingness to learn new languages and techniques to solve challenging problems.\nExperience in functional programming fundamentals.\nBS degree in Computer Science, related degree or equivalent. Graduating before August 2023.\nAbility to write clean code that works, is readable, maintainable and follows best practices and coding standards\nUnderstanding of OO and functional design, languages, algorithms and data structures\nA philosophy of iteration and continuous improvement\nA desire to own design and architecture end to end\nCOVID-19 Considerations\nWe value the safety of each member of our community because we know we’re all in this together. In many locations, which may change over time, we’ve implemented a virtual hiring process and continue to interview candidates by video or phone. In addition, in some locations, only individuals who have been fully vaccinated will be permitted inside Mastercard offices until further notice.\nIn the US, Mastercard is a government contractor, which may legally require most Mastercard employees to be vaccinated unless a verified approved medical or religious exemption is granted. Further, we are currently making every effort towards having employees return to work in the office 2 days per week, if that makes sense for their team. Everyone must be vaccinated to enter Mastercard offices at this time. Therefore, we expect all candidates to be vaccinated or to be approved for a medical or religious accommodation prior to commencing work at Mastercard.\nIn the US, Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact [email protected] and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.\nCorporate Security Responsibility\nResponsibilities\nAll activities involving access to Mastercard assets, information, and networks comes with an inherent risk to the organization and, therefore, it is expected that every person working for, or on behalf of, Mastercard is responsible for information security and must\nAbide by Mastercard’s security policies and practices;\nEnsure the confidentiality and integrity of the information being accessed;\nReport any suspected information security violation or breach, and\nComplete all periodic mandatory security trainings in accordance with Mastercard’s guidelines."
  },
  {
    "company": "Bloomberg Industry Group",
    "title": "Full Stack Engineering Intern. In-Person",
    "company_url": "https://www.linkedin.com/company/bloomberg-industry-group?trk=public_jobs_topcard-org-name",
    "location": "Arlington, VA",
    "details": "Full time\nTechnical Skills\nUnderstanding of core Computer Science concepts\nSolid knowledge of the programming language that the team uses, i.e. JavaScript, Phython or Java, SQL Etc.\nFocus will be on growing as an engineer, learning existing tools, resources and processes.\nProductivity\nCapable of taking well-defined sub-tasks and completing these tasks\nFocus will be on developing productivity skills by learning source control, editors, the build system, diagnose tools, and other tools as well as testing best practices\nImpact\nCapable of providing on-call support for their area\nFocus on developing knowledge and self-sufficiency in at least one area of our architecture or codebase\nCommunication & Leadership\nEffective in communicating status to the team\nExhibits INDG's core values, focuses on understanding and living these values\nAccepts feedback graciously and learns from everything they do\nBloomberg Industry Group IS AN EQUAL OPPORTUNITY EMPLOYER and fully subscribes to the principles of Equal Employment Opportunity. Bloomberg Industry Group has adopted an Affirmative Action Program to ensure that all applicants and employees are considered for hire, promotion, and job status without regard to race, color, religion, sex, national origin, age, disability, gender identity, sexual orientation, marital or familial status, pregnancy, childbirth, or related medical issues, genetic information, disabled veteran, veteran, a veteran of the Vietnam Era, or any other classification protected by law.\nINDG requires all employees to be fully vaccinated for COVID-19 as a condition of employment.\nProspective and/or new employees will be required to adhere with INDG's vaccination policy. All INDG employees must be fully vaccinated and they must submit proof of vaccination on their first day of employment. Prospective or new employees may seek a medical or religious exemption to the vaccination requirement but must have an approved exemption prior to the start of their employment."
  },
  {
    "company": "RM Talent Solutions",
    "title": "Software Engineer Co-op: Fall 2022. In-Person",
    "company_url": "https://www.linkedin.com/company/rm-talent-solutions?trk=public_jobs_topcard-org-name",
    "location": "Texas, United States",
    "details": "RM Talent Solutions is a platform that helps businesses grow and operate. RippleMatch is one of our clients which is a job matching platform that helps companies such as Texas Instruments, Anheuser-Busch, Siemens, eBay, and hundreds more recruit faster and with more convenience.\nWe are shaping the way college students find jobs and internships. We work with several top-tier companies, Fortune 500's, start-ups, and non-profits.\nWe use Artificial Intelligence which makes sure that companies find the best candidates for their job roles and students find the best positions where they get a higher chance to secure a job/internship than the traditional recruitment methods.\nIf you meet the below eligibility criteria, please apply and our recruitment team will connect with you to understand your strengths and strategize your career ahead.\nWe aim to build a strong connection with all of our applicants, so that we may help them achieve their career goals both today and in the future.\nEligibility Criteria:\nYour undergraduate graduation year is 2022 or later.\nYou are working towards a Bachelor's/Master’s/Ph.D degree.\nJob Requirements:\nYou have had exposure to coursework on subjects like distributed systems, concurrency control, data replication, file systems, or SQL processing.\nComfort using programming languages like Javascript, React, Redux, Go, C/C++, Java, and Python/Django. We use React.js, Redux, and Typescript on the client-side and use Go on the server side. If you don't know any of these languages, you'll learn them while you're here.\nYou love building relationships with your colleagues. You enjoy being part of the code review process and partnering with your teammates on challenging problems.\nTo apply for a Software Engineering Internship, candidates must meet the following requirements:\nMinimum GPA: 3.0 strongly preferred, may consider 2.7 and above.\nWork Authorization: Applicants must be legally authorized for employment in the United States without the need for current or future employer-sponsored work authorization.\nDesire to work within the United States.\nApply now and we'll connect with you to explore your best matches!"
  },
  {
    "company": "Amazon",
    "title": "Full Stack Software Engineering Intern. Remote",
    "company_url": "https://www.linkedin.com/company/amazon?trk=public_jobs_topcard-org-name",
    "location": "Seattle, WA",
    "details": "Job Summary\nDESCRIPTION\nAmazon fall SDE internships are full-time (40 hours/week) for 12 consecutive weeks with start dates between August and September 2022. Applicants should have a minimum of one quarter/semester remaining in their studies after their internship concludes.\nAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The intense focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA. Our interns write real software and collaborate with a select group of experienced software development engineers (SDEs) who guide interns on projects that matter to our customers.\nAs an intern, you will be matched to a manager and a mentor. You will have the opportunity to influence the evolution of Amazon technology and lead mission critical projects early in your career. Your design, code, and raw smarts will contribute to solving some of the most complex technical challenges in the areas of distributed systems, data mining, automation, optimization, scalability, and security – just to name a few.\nIn addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in activities with other interns throughout your internship. No matter the location of your internship, we give you the tools to own your project and learn in a real-world setting. Many of our technologies overlap, and you would be hard pressed to find a team that is not using Amazon Web Services (AWS), touching the catalogue, or iterating services to better personalize for customers.\nKey Job Responsibilities\nCollaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market.\nDesign and build innovative technologies in a large distributed computing environment, and help lead fundamental changes in the industry.\nCreate solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\nBuild distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\nAbility to design and code the right solutions starting with broadly defined problems.\nWork in an agile environment to deliver high-quality software.\nLocations\nBy applying to this position your application will be considered for all locations we hire for in the United States. This includes, but is not limited to:\nCA (Culver City, Cupertino, Irvine, Palo Alto, San Francisco, Santa Clara, Sunnyvale, Santa Barbara, Santa Cruz, Santa Monica)\nCO (Boulder, Denver)\nGA (Atlanta)\nMA (Boston, Cambridge, North Reading)\nNY (New York)\nTX (Austin)\nVA (Arlington, Herndon)\nWA (Bellevue, Seattle, Redmond)\n***Locations are subject to change.***\nIf this opportunity interests you, apply and come chart your own path at Amazon!\nBasic Qualifications\nCurrently enrolled in an Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, Data Science, Electrical Engineering, or majors relating to these fields are considered with an expected conferral date later than 4/30/2023.\nProgramming experience with at least one modern language such as Java, C++, or C# including object-oriented design.\nPreferred Qualifications\nPrevious technical internship(s), if applicable.\nExperience with distributed, multi-tiered systems, algorithms, and relational databases.\nExperience in optimization mathematics such as linear programming and nonlinear optimization.\nAbility to effectively articulate technical challenges and solutions.\nAdept at handling ambiguous or undefined problems as well as ability to think abstractly.\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\nPursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\nThe pay for this position in Colorado is $8,224/month. Fulltime interns working longer than 90 days will be eligible for access to a medical benefit, and can enroll in a 401k on Day 1 if age 18. Interns will also have access to paid time off. This information is provided per the Colorado Equal Pay Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site.\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\nCompany - Amazon.com Services LLC\nJob ID: A2013931"
  },
  {
    "company": "RM Talent Solutions",
    "title": "Backend Software Engineer Intern. Remote",
    "company_url": "https://www.linkedin.com/company/rm-talent-solutions?trk=public_jobs_topcard-org-name",
    "location": "Florida, United States",
    "details": "About The Internship\nA client of (Consulting Company) is looking to hire Software Engineering Interns for their team. Their main responsibilities include gathering user requirements, defining system functionality and writing code in various languages, like Java, Ruby on Rails or .NET programming languages (e.g. C++ or JScript.NET.) Typically they are supposed to be familiar with the software development life cycle (SDLC) from preliminary system analysis to tests and deployment.\nEligibility Criteria:\n• Undergraduate- Preferable Graduation Year is 2023 or later.\n• You are working towards a Bachelor's degree in Software Engineering Internship\n• Minimum GPA: 3.0 strongly preferred, may consider 2.7 and above.\n• Work Authorization: Applicants must be legally authorized for employment in the United States without the need for current or future employer-sponsored work authorization.\nJob Requirements:\n• Execute full software development life cycle (SDLC)\n• Develop flowcharts, layouts and documentation to identify requirements and solutions\n• Write well-designed, testable code\n• Produce specifications and determine operational feasibility\n• Integrate software components into a fully functional software system\n• Develop software verification plans and quality assurance procedures\n• Document and maintain software functionality\n• Troubleshoot, debug and upgrade existing systems\n• Deploy programs and evaluate user feedback\n• Comply with project plans and industry standards\n• Ensure software is updated with latest features\nApply now and we'll connect with you to explore your best matches!"
  },
  {
    "company": "Toast",
    "title": "Software Engineer Intern. Remote",
    "company_url": "https://www.linkedin.com/company/toast-inc?trk=public_jobs_topcard-org-name",
    "location": "United States",
    "details": "Toast is driven by building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love.\nAbout this roll* (Responsibilities)\nToast is looking for self-motivated individuals who love building great software and want to have fun while doing it. We work extensively with Android, iOS, and web front ends, where we work hard to provide a well-designed user interface for our customers. Our infrastructure runs in Amazon Web Services where we run Java microservices in Docker containers; our customers rely on us to keep this infrastructure fast and stable so that their point-of-sale system \"just works\", despite being a complex distributed system. We need talented engineers to build and maintain the highest quality product as our vision moves forward.\nWhat You Will Do\nWork on a small team of 3-6 engineers, responsible for entire modules of the Toast product\nBuild, and maintain high performance, flexible, and highly scalable web and mobile applications\nParticipate in designing, estimating effort, implementing, testing, debugging, configuring, integrating and documenting database, middle-tier and front-end code\nDiagnose performance bottlenecks and implement optimizations\nThink in terms of the end-user and design accordingly\nActively contribute to product design and feature selection discussions\nParticipate in code reviews to ensure technical implementations meet functional requirements\nDo you have the right ingredients*? (Requirements)\nCurrently enrolled in an academic program\nDeep Java development experience\nMobile software development experience, preferably with Android\nWell-versed in tiered web application architecture and databases\nProficient in the web front-end basics - HTML, CSS and JavaScript\nAvailability to work full time from July/September-December\nBread puns encouraged but not required\nOur Tech Stack\nToast’s products run on a stack that ranges from guest and restaurant-facing Android tablets to backend services in Java to internal, guest-facing and restaurant-facing web apps. The main Toast POS application is an Android application written in Java and Kotlin. Our backend services follow a microservice architecture written using Java and DropWizard; we use AWS extensively, ranging from S3 to RDS to Lambda. We have our own platform for dealing with user management, service elevations and robust load balancing. Toast stores data in a set of sharded Postgres databases and utilizes Apache Spark for large scale data workloads including query and batch processing. The front-end is moving towards React and ES6. For data between tablets and our cloud platform we operate RabbitMQ clusters as well as direct tablet communication to the back end.\nWe are Toasters\nDiversity, Equity, and Inclusion is Baked into our Recipe for Success.\nAt Toast our employees are our secret ingredient. When they are powered to succeed, Toast succeeds.\nThe restaurant industry is one of the most diverse industries. We embrace and are excited by this diversity, believing that only through authenticity, inclusivity, high standards of respect and trust, and leading with humility will we be able to achieve our goals.\nBaking inclusive principles into our company and diversity into our design provides equitable opportunities for all and enhances our ability to be first in class in all aspects of our industry.\nBready* to make a change? Apply today!\nToast is committed to creating an accessible and inclusive hiring process. As part of this commitment, we strive to provide reasonable accommodations for persons with disabilities to enable them to access the hiring process. If you need an accommodation to access the job application or interview process, please contact accommodations@toasttab.com.\nFor roles based in the United States: As part of our commitment to the health and safety of our employees and their families, all individuals entering our US workspaces are required to provide proof of full vaccination against COVID-19 unless they have an approved medical or religious accommodation."
  },
  {
    "company": "Amazon",
    "title": "Software Engineer - 2022. In-Person",
    "company_url": "https://www.linkedin.com/company/amazon?trk=public_jobs_topcard-org-name",
    "location": "Seattle, WA",
    "details": "Description\nAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The intense focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA. Our interns write real software and collaborate with a select group of experienced software development engineers (SDEs) who guide interns on projects that matter to our customers.\nAs an intern, you will be matched to a manager and a mentor. You will have the opportunity to influence the evolution of Amazon technology and lead mission critical projects early in your career. Your design, code, and raw smarts will contribute to solving some of the most complex technical challenges in the areas of distributed systems, data mining, automation, optimization, scalability, and security – just to name a few.\nIn addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in activities with other interns throughout your internship. No matter the location of your internship, we give you the tools to own your project and learn in a real-world setting. Many of our technologies overlap, and you would be hard pressed to find a team that is not using Amazon Web Services (AWS), touching the catalogue, or iterating services to better personalize for customers.\nKey Job Responsibilities\nCollaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market.\nDesign and build innovative technologies in a large distributed computing environment, and help lead fundamental changes in the industry.\nCreate solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\nBuild distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\nAbility to design and code the right solutions starting with broadly defined problems.\nWork in an agile environment to deliver high-quality software.\nAmazon internships are full-time (40 hours/week) for 12 consecutive weeks with start dates between May and June 2022. Applicants should have a minimum of one quarter/semester remaining in their studies after their internship concludes.\nNOTE: By applying to this position your application will be considered for all locations we hire for in the United States. This includes, but is not limited to AZ (Phoenix, Tempe); CA (Berkeley, Culver City, Cupertino, East Palo Alto, Irvine, Los Angeles, Manhattan Beach, Palo Alto, San Francisco, San Jose, Santa Clara, Sunnyvale, San Diego, San Luis Obispo, Santa Barbara, Santa Cruz, Santa Monica) CO (Boulder, Denver); GA (Atlanta, Kennesaw); MA (Boston, Cambridge, North Reading); MD (Baltimore); MI (Detroit); MN (Minneapolis); NJ (Jersey City); NY (New York); OR (Portland); PA (Philadelphia, Pittsburg); TN (Nashville); TX (Austin, Dallas); VA (Arlington, Herndon); WI (Madison), WA (Bellevue, Seattle, Redmond). Locations are subject to change.\nIf this opportunity interests you, apply and come chart your own path at Amazon.\nNOTE: Applications are reviewed on a rolling basis. For an update on your status, or to confirm your application was submitted successfully, please login to your candidate portal. Please understand that we are reviewing a high volume of applicants, and appreciate your patience as we review applications for future Amazonians!\nBasic Qualifications\nCurrently enrolled in an Associate’s, Bachelor’s or Master’s Degree in Computer Science, Computer Engineering\nProgramming experience with at least one modern language such as Java, C++, or C# including object-oriented design\nIn addition to Computer Science and Computer Engineering, Data Science, Electrical Engineering, or majors relating to these fields are considered\nPreferred Qualifications\nPrevious technical internship(s), if applicable.\nExperience with distributed, multi-tiered systems, algorithms, and relational databases.\nExperience in optimization mathematics such as linear programming and nonlinear optimization.\nAbility to effectively articulate technical challenges and solutions.\nAdept at handling ambiguous or undefined problems as well as ability to think abstractly.\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\nPursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\nThe pay for this position in Colorado is $8,224/month. Fulltime interns working longer than 90 days will be eligible for access to a medical benefit, and can enroll in a 401k on Day 1 if age 18. Interns will also have access to paid time off. This information is provided per the Colorado Equal Pay Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site.\nCompany - Amazon.com Services LLC\nJob ID: A1557929"
  },
  {
    "company": "RM Talent Solutions. In-Person",
    "title": "Software Engineer Intern",
    "company_url": "https://www.linkedin.com/company/rm-talent-solutions?trk=public_jobs_topcard-org-name",
    "location": "New York City Metropolitan Area",
    "details": "About Us\nRippleMatch is a job matching platform that helps companies such as Texas Instruments, Anheuser-Busch, Siemens, eBay, and hundreds more recruit faster and with more convenience.\nWe are shaping the way college students find jobs and internships. We work with several top-tier companies, Fortune 500's, start-ups, and non-profits.\nWe use Artificial Intelligence which makes sure that companies find the best candidates for their job roles and students find best positions where they get a higher chance to secure a job/internship.\nIf you meet the below eligibility criteria, please apply and our recruitment team will connect with you to understand your strengths and strategize your career ahead.\nWe aim to build a strong connection with all of our applicants, so that we may help them achieve their career goals both today and in the future.\nEligibility Criteria:\nYour undergraduate graduation year is 2023 or later.\nYou are working towards a Bachelor's/Master’s degree.\nJob Requirements:\nTo apply for a Software Engineering Internship, candidates must meet the following requirements:\nMinimum GPA: 3.0 strongly preferred, may consider 2.7 and above.\nWork Authorization: Applicants must be legally authorized for employment in the United States without the need for current or future employer-sponsored work authorization.\nDesire to work within the United States\nApply now and we'll connect with you to explore your best matches!"
  },
  {
    "company": "Sumo Logic",
    "title": "Software Engineer Intern. Remote",
    "company_url": "https://www.linkedin.com/company/sumo-logic?trk=public_jobs_topcard-org-name",
    "location": "Redwood City, CA",
    "details": "Intern, BE Software Engineer\nWho Are We?\nWe are a secure, cloud-native, machine data analytics service, delivering real-time, continuous intelligence from structured, semistructured and unstructured data across the entire application lifecycle and stack. Our mission is to democratize analytics, making it accessible, simple and powerful for businesses of all sizes to build, run and secure their organizations. With Sumo Logic, customers can harness the power of machine data to gain operational business and customer insights that lead to competitive advantage and differentiated customer experience.\nWhat Do We Do?\nSumo Logic was founded in 2010 by experts in log management, scalable big data systems. We imagined a world of Yottabyte-scale machine data, where machine learning algorithms and advanced analytics could make sense of it all. Today, our purpose-built, cloud-native service analyzes more than 100 petabytes of data, more than 16 million searches, and delivers 10s of millions of insights daily – positioning Sumo among the most powerful machine data analytics services in the world. Our customers around the globe rely on Sumo Logic for the analytics and insights to build, run and secure their modern applications and cloud infrastructures. With Sumo Logic, customers gain a service-model advantage to accelerate their shift to continuous innovation, increasing competitive advantage, business value and growth..\nThe proliferation of machine log data has the potential to give organizations unprecedented real-time visibility into their infrastructure and operations. With this opportunity comes tremendous technical challenges around ingesting, managing, and understanding high-volume streams of heterogeneous data.\nAs an Intern on our Backend Engineering team, you’ll be responsible for designing and developing a piece of our complex event based processing platform and data infrastructure for our enterprise service. You will be working on a highly distributed, fault tolerant, multi-tenant framework that includes leading edge components related to storage, messaging, search, and analytics.\nYou should be a quick learner and a strong coder in Java or Scala.\nOur Ideal Candidate Will be entering their senior year of B.S or M.S!\nResponsibilities\nDesign and develop components of the multi-tenant event-based processing platform\nDesign and develop data pipeline and systems for management and manipulation of very large data sets\nDesign and implement extremely high-volume, fault-tolerant, scalable backend systems\nAnalyze and improve efficiency, scalability, and reliability of data processing components.\nRequirements\nPursuing a BS, MS, or PhD in Computer Science\nObject-oriented programming using Java or Scala\nExperience building backend systems in distributed computing environments\nAlgorithms and performance characteristics of large distributed software systems\nDesired\nExperience with real-time streaming workflow over large amounts of data\nMulti-threaded programming;\nAbout Us\nSumo Logic is the pioneer in continuous intelligence, a new category of software, which enables organizations of all sizes to address the data challenges and opportunities presented by digital transformation, modern applications, and cloud computing. The Sumo Logic Continuous Intelligence Platform™ automates the collection, ingestion, and analysis of application, infrastructure, security, and IoT data to derive actionable insights within seconds. More than 2,100 customers rely on Sumo Logic to build, run, and secure their modern applications and cloud infrastructures. Only Sumo Logic delivers its platform as a true, multi-tenant SaaS architecture, across multiple use-cases, enabling businesses to thrive in the Intelligence Economy."
  },
  {
    "company": "TaxBit",
    "title": "Software Engineer Intern. In-Person",
    "company_url": "https://www.linkedin.com/company/taxbitteam?trk=public_jobs_topcard-org-name",
    "location": "Seattle, WA",
    "details": "About TaxBit\nTaxBit is helping to drive mainstream adoption of digital assets by connecting the consumer, enterprise, and government tax and accounting ecosystems.\nOur Software-as-a-Service platform streamlines our customers' reporting experience across traditional and digital asset classes. We are trusted in this work by thousands of consumers, leading exchanges and enterprises, government agencies (including the IRS), respected accounting firms, and others to solve complex accounting problems at scale and ensure compliance with the latest tax laws. TaxBit investors include Paradigm, Tiger Global, PayPal Ventures, Winklevoss Capital, Coinbase Ventures, and other leading crypto investors. Our team is located in Salt Lake City, UT and Seattle, WA.\nIf you're searching for a company that's dedicated to your growth, recognizes your unique contribution, and provides a fun, flexible and inclusive work environment, then TaxBit is the place for you. We're looking for team members ready to join a hypergrowth company and are excited to work at the forefront of an entirely new industry.\nWho You Are\nAs a Software Intern at TaxBit, you should be passionate about software and people. You will help us build complex systems to create a top quality experience for our customers and clients. You will help to implement software solutions in an effort to deliver amazing experiences and capabilities for our customers and clients. The ideal intern is someone who is humble, hungry and smart and runs after problems. They will be one who can inspire others, communicate clearly, and ensure that our clients have the best experience possible.\nThis is what you'll do on a day to day basis\nBuild complex, modern applications with beautiful, consistent and fast functionalities for our customers\nWrite well-designed, well-tested, readable, maintainable code\nParticipate in code reviews to maintain code quality and distribute knowledge\nWhat You'll Need\nYou are either an undergrad or grad student in Computer Science/Information Science/Engineering\nYou have strong skills in Javascript (React), NodeJS or Python\nCare about software architecture across the front-end, back-end, and the APIs that glue them\nPassionate about code quality, continuous delivery, automated testing\nComfortable working in an agile environment and challenging yourself and your team to improve their ways of working\nExcellent analytical and problem-solving skills and can communicate your ideas, especially to those not technologically proficient\nWhy you want to work here\nCompetitive cash compensation\nRestricted Stock Units\nHealth, Dental, Vision, and Life Insurance\nHybrid working model: 3 days in-office, 2 days WFH/flexible\nFriday team lunches\nAutonomous work and flexibility in how work is performed\nVaccines are mandatory in order to foster a safe environment."
  },
  {
    "company": "RM Talent Solutions",
    "title": "Software Engineering Intern. In-Person",
    "company_url": "https://www.linkedin.com/company/rm-talent-solutions?trk=public_jobs_topcard-org-name",
    "location": "Tampa, FL",
    "details": "About Us\nRippleMatch is a job matching platform that helps companies such as Texas Instruments, Anheuser-Busch, Siemens, eBay, and hundreds more recruit faster and with more convenience.\nWe are shaping the way college students find jobs and internships. We work with several top-tier companies, Fortune 500's, start-ups, and non-profits.\nWe use Artificial Intelligence which makes sure that companies find the best candidates for their job roles and students find best positions where they get a higher chance to secure a job/internship.\nIf you meet the below eligibility criteria, please apply and our recruitment team will connect with you to understand your strengths and strategize your career ahead.\nWe aim to build a strong connection with all of our applicants, so that we may help them achieve their career goals both today and in the future.\nEligibility Criteria:\nYour undergraduate graduation year is 2023 or later.\nYou are working towards a Bachelor's/Master’s degree.\nJob Requirements:\nTo apply for a Software Engineering Internship, candidates must meet the following requirements:\nMinimum GPA: 3.0 strongly preferred, may consider 2.7 and above.\nWork Authorization: Applicants must be legally authorized for employment in the United States without the need for current or future employer-sponsored work authorization.\nDesire to work within the United States\nApply now and we'll connect with you to explore your best matches!"
  },
  {
    "company": "2U",
    "title": "Software Engineer Intern. In-Person",
    "company_url": "https://www.linkedin.com/company/2u?trk=public_jobs_topcard-org-name",
    "location": "Cambridge, MA",
    "details": "The 2ternship\n2U’s internship program, the 2ternship, has been a critical part of 2U's growth since the inception of the company. Many individuals, including some executive leaders, started their careers as 2terns and continue their tenure today here at 2U.\nA 2ternship allows students to build skill sets in their area of interest, gain real world business experience and receive ongoing feedback to maximize their professional development. 2terns experience this all while being a part of a diverse and inclusive organization that is working towards one common mission - making education more accessible and global.\nAs 2U grows, we aim to continue attracting top talent to this program. Check out #LifeAt2U on Instagram and Twitter to see what our culture is like and more of what our 2terns experience on a daily basis.\nOpen Courses and Marketplace (edX)\nedX was launched as a joint software venture between MIT and Harvard. We’re on a mission to increase access to online education to learners worldwide. It’s now part of 2U as Open courses and Marketplace. We are excited about what this means to the online education community.\nWe’re seeking a Software Engineering intern to join our product delivery teams. The team focuses on solving learners’ needs through a set of courses building towards a significant educational outcome. This will be a major focus for 2U this year and we're looking for an eager engineer to help implement and invent to drive learner outcomes.\nResponsibilities\nDesign, develop, deploy, and support scalable software systems\nCollaborate with Product Management, UX, and Data Science to understand business problems and identify solutions\nContribute to the engineering team by leveraging your skills in technical direction, priority setting, and execution/delivery.\nBuild and maintain operationally viable solutions throughout its life cycle.\nCommit to owning your code and supporting the customer facing environment\nQualifications & Skills\nExperience with web technologies like HTML, CSS, Javascript and RESTful APIs\nExperience with Reactjs or other frontend frameworks\nExposure to server based backend technologies, such as Python, Django, MySQL.\nAbility to problem solve, drive projects with loosely defined requirements, communicate with stakeholders, and learn from both success and failure.\nValues teamwork, collaboration and an evolving start-up atmosphere.\nPreferred\nWorking towards a degree in a Computer Science related field, or comparable bootcamp / certification milestones.\nExperience with accessibility best practices and compliant front-end development standards.\nExtra points if you share an active Github profile or side project you’re proud of.\nExperience working in an agile development environment.\nCommitted to documentation best practices - your code will be consumed in an open source environment!\nAbout 2U Inc. (NASDAQ: TWOU)\n2U is comprised of 3 lines of business: Graduate Degree Programs, Short Course, and Boot Camps. Going beyond traditional learning management systems, we use tech, people, and data to help top universities and enterprise organizations transform in the digital era—and eliminate the back row in higher ed. We support lifelong learning which means thinking beyond a single degree. It means finding ways for students to gain the skills they need to change careers, evolve their expertise, and meet the challenges of the changing world head-on. We help our partners fill those needs—developing new digital education technologies and offerings capable of supporting students at different points in their lives. Whether they need a simple refresher, to learn something new, or to change their career trajectories completely, our partners are there to help them succeed. Together with our partners, 2U has positively transformed the lives of more than 275,000 students and lifelong learners.\n2U Diversity and Inclusion Statement\nAt 2U, we are committed to creating and sustaining a culture that embodies diverse walks of life, ideas, genders, ages, races, cultures, sexual orientations, abilities and other unique qualities of our employees. We strive to offer a workplace where every employee feels empowered by the ways in which we are different, as well as the ways in which we are the same.\nBenefits & Culture\nWorking at 2U means working with individuals that are passionate and mission driven. We collaborate on tough problems to deliver the best outcomes for our partners, students, and each other. You will find team members working together in our open office spaces, gathered in the kitchen grabbing a snack, or taking a break in our game rooms.\nTo learn more, visit 2U.com. #NoBackRow\nNote: The above statements are intended to describe the general nature and level of work performed by individuals assigned to this position, and are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed.\n2U is an equal opportunity employer that does not discriminate against applicants or employees and ensures equal employment opportunity for all persons regardless of their race, creed, color, religion, sex, sexual orientation, pregnancy, national origin, age, marital status, disability, citizenship, military or veterans’ status, or any other classifications protected by applicable federal, state or local laws. 2U’s equal opportunity policy applies to all terms and conditions of employment, including but not limited to recruiting, hiring, training, promotion, job benefits, pay and dismissal."
  },
  {
    "company": "RM Talent Solutions",
    "title": "Backend Engineering Intern. Remote",
    "company_url": "https://www.linkedin.com/company/rm-talent-solutions?trk=public_jobs_topcard-org-name",
    "location": "Chicago, IL",
    "details": "About Us\nRippleMatch is a job matching platform that helps companies such as Texas Instruments, Anheuser-Busch, Siemens, eBay, and hundreds more recruit faster and with more convenience.\nWe are shaping the way college students find jobs and internships. We work with several top-tier companies, Fortune 500's, start-ups, and non-profits.\nWe use Artificial Intelligence which makes sure that companies find the best candidates for their job roles and students find best positions where they get a higher chance to secure a job/internship.\nIf you meet the below eligibility criteria, please apply and our recruitment team will connect with you to understand your strengths and strategize your career ahead.\nWe aim to build a strong connection with all of our applicants, so that we may help them achieve their career goals both today and in the future.\nEligibility Criteria:\nYour undergraduate graduation year is 2023 or later.\nYou are working towards a Bachelor's/Master’s degree.\nJob Requirements:\nTo apply for a Software Engineering Internship, candidates must meet the following requirements:\nMinimum GPA: 3.0 strongly preferred, may consider 2.7 and above.\nWork Authorization: Applicants must be legally authorized for employment in the United States without the need current or future employer-sponsored work authorization.\nDesire to work within the United States\nApply now and we'll connect with you to explore your best matches!"
  },
  {
    "company": "Redfin",
    "title": "Internship. Remote",
    "company_url": "https://www.linkedin.com/company/redfin?trk=public_jobs_topcard-org-name",
    "location": "San Francisco, CA",
    "details": "Redfin (Nasdaq: RDFN) is revolutionizing the $75 billion real estate industry. We use data, beautiful software, and innovative design to put customers first at every step in the home-buying and selling process. Get ready to dive headfirst into our award-winning website and mobile apps, solving complex business problems in a highly visible, customer-centric way. If you value doing great work in a collaborative environment, join our team!\nAs a Software Developer intern, you'll use your technical skills to empower millions of our users, including customers and real estate agents, with the latest end-to-end technology. We are looking for eager full-stack developer(s) to work on technology that brings previously unimaginable ease and simplicity in real estate transactions for home buyers and sellers.\nThe Role\nUse tools and technology across all layers of the development stack, from Java, JavaScript, React, and React Native, to Kafka, to Kubernetes, and use different cloud technologies to build engaging, intuitive web and mobile experiences for home buying and selling homes\nTackle complex technical problems that reach across the company, learning about every part of the business\nGet exposure to all levels of the company and a management team invested in your growth and success\nDesired Skills & Experience\nPursuing a Bachelor's, Master's, or Ph.D. degree in engineering, computer science, or related field with at least one semester/quarter remaining after internship\nKnowledge of one or more software development languages (Java, C++, JavaScript, Python, Objective-C, Swift, Ruby, etc), CS fundamentals, algorithms, and data structures\nThe ability to deal with ambiguity, communicate well with partner teams - both technical and non technical, and a strong empathy for the customer experience\nYou’re a full-stack developer who can crank out rock-solid code\nYou think like an end user and crave simple, beautiful interfaces\nWhat We Offer\nSupport and resources to continue learning, a brilliant team with which to collaborate, and a commitment to your career so you can grow with the company under a management team that has experience building startups into profitable, publicly traded companies\nFar more responsibility than at a big company, while at the same time far less stress than you will find in a 2-person startup\nThe fruits of your labor are released every day and you'll share in our joy as we hear back from customers and national media\nA well-defined career ladder and management support to help grow your career.\nCompetitive compensation packages with a salary, bonuses, restricted stock grants, and generous benefits\nRedfin is an equal opportunity employer committed to hiring a diverse workforce.\nTo ensure the health and safety of our workforce, customers and third parties, Redfin conducts background screening after making conditional offers for employment. All screening is conducted consistent with Equal Employment Opportunity Commission guidance and state and local Fair Chance Act guidance, and Redfin encourages applications from, and fully considers, qualified applicants with criminal record histories."
  },
  {
    "company": "TaxBit",
    "title": "Software Developer Intern. Remote",
    "company_url": "https://www.linkedin.com/company/taxbitteam?trk=public_jobs_topcard-org-name",
    "location": "Draper, UT",
    "details": "About TaxBit\nTaxBit is helping to drive mainstream adoption of digital assets by connecting the consumer, enterprise, and government tax and accounting ecosystems.\nOur Software-as-a-Service platform streamlines our customers' reporting experience across traditional and digital asset classes. We are trusted in this work by thousands of consumers, leading exchanges and enterprises, government agencies (including the IRS), respected accounting firms, and others to solve complex accounting problems at scale and ensure compliance with the latest tax laws. TaxBit investors include Paradigm, Tiger Global, PayPal Ventures, Winklevoss Capital, Coinbase Ventures, and other leading crypto investors. Our team is located in Salt Lake City, UT and Seattle, WA.\nIf you're searching for a company that's dedicated to your growth, recognizes your unique contribution, and provides a fun, flexible and inclusive work environment, then TaxBit is the place for you. We're looking for team members ready to join a hypergrowth company and are excited to work at the forefront of an entirely new industry.\nWho You Are\nAs a Software Intern at TaxBit, you should be passionate about software and people. You will help us build complex systems to create a top quality experience for our customers and clients. You will help to implement software solutions in an effort to deliver amazing experiences and capabilities for our customers and clients. The ideal intern is someone who is humble, hungry and smart and runs after problems. They will be one who can inspire others, communicate clearly, and ensure that our clients have the best experience possible.\nThis is what you'll do on a day to day basis\nBuild complex, modern applications with beautiful, consistent and fast functionalities for our customers\nWrite well-designed, well-tested, readable, maintainable code\nParticipate in code reviews to maintain code quality and distribute knowledge\nWhat You'll Need\nYou are either an undergrad or grad student in Computer Science/Information Science/Engineering\nYou have strong skills in Javascript (React), NodeJS or Python\nCare about software architecture across the front-end, back-end, and the APIs that glue them\nPassionate about code quality, continuous delivery, automated testing\nComfortable working in an agile environment and challenging yourself and your team to improve their ways of working\nExcellent analytical and problem-solving skills and can communicate your ideas, especially to those not technologically proficient\nWhy you want to work here\nCompetitive cash compensation\nRestricted Stock Units\nHealth, Dental, Vision, and Life Insurance\nHybrid working model: 3 days in-office, 2 days WFH/flexible\nFriday team lunches\nAutonomous work and flexibility in how work is performed\nVaccines are mandatory in order to foster a safe environment."
  },
  {
    "company": "IGN Entertainment",
    "title": "Software Engineer Intern",
    "company_url": "https://www.linkedin.com/company/ign-entertainment?trk=public_jobs_topcard-org-name",
    "location": "United States",
    "details": "Description\nSoftware Engineer Intern: The IGN Code Foo program is an eight-week remote, paid internship where you’ll have the opportunity to work on real engineering projects that will be seen by millions of users. While you’re with us, you’ll be mentored by our experienced team of software engineers and work in tandem on actual IGN products. During your time here you’ll get the chance to develop with different languages and technologies including (but not limited to) JavaScript, React, GraphQL, Node, PostgreSQL, MongoDB, Redis, Swift, and Kotlin. You’ll be utilizing these technologies while working on web apps, content management systems, APIs, native mobile apps and more.\nCode Foo 10 is open to those who are eligible to work in the US. We recommend aspiring engineers of all levels to apply.\nApplications must be submitted by Saturday, April 30th, 2022 (11:59pm PDT). For more details, and to submit an application, visit https://www.ign.com/code-foo/2022.\n#IGN"
  },
  {
    "company": "Human Interest",
    "title": "Software Engineer - 2022. Remote",
    "company_url": "https://www.linkedin.com/company/humaninterest?trk=public_jobs_topcard-org-name",
    "location": "San Francisco, CA",
    "details": "Human Interest is on a mission to ensure that people in all lines of work have access to retirement benefits. Nearly half of all working Americans are not saving enough for their future because they are employed by a company that doesn't offer a retirement plan. Human Interest is changing that by making it affordable and accessible for small and medium sized businesses to offer employees a path to financial independence through retirement savings.\nOur values (the guiding principles that reflect our view on what's important and what's right): In it for customers, autonomous & accountable, outcomes driven, inclusive collaboration, and decisive.\nWhat You Get To Do Every Day\nYou will be embedded as a full-time member of one of our engineering teams.\nSupport internal and external customer needs, collaborate with cross functional engineering teams.\nConvert requirements into functional application code.\nWrite clean, high-quality code and tests while keeping the system fast and reliable.\nYou will get to work with smart and hardworking engineering teams, product managers, and stakeholders across the org.\nWhat You Bring To The Role\nFamiliarity with TypeScript, Node.JS, SQL, AWS, GraphQL.\nFamiliarity with web services and API's including microservices.\nFamiliarity with tools and technologies like GIt, AWS, Docker.\nDemonstrated passion for technology and enjoy collaborating with others in a fast-paced environment.\nStrong communication skills, verbal and written.\nActively pursuing a Bachelors, Masters or PhD in Computer Science, Software Engineering, Computer Engineering,Electrical Engineering, mathematics or a related technical field, and a strong record of academic achievement.\nNice to have:\nKnowledge of CI/CD and DevOps practices preferred.\nFamiliarity with Coding Best Practices is desired.\nPlease feel free to apply to this position even if you do not meet 100% of the requirements listed above.\nWhy you will love working at Human Interest\nMission - Highly collaborative startup dedicated to supporting employee engagement and growth. It's an opportunity to help solve one of the biggest unsolved problems in America: saving for retirement.\nAbout Human Interest:\nWe're a high-growth, Series D-funded company that's changing the retirement industry. Named one of America's Best Startup Employers by Forbes, one of the Best Places to Work by the San Francisco Business Times, and a Top Company by Y Combinator, we've raised $305M and are backed by leading investors, including TPG (The Rise Fund), SoftBank, Glynn Capital, NewView Capital, USVP, Wing, Uncork, and others.\nInclusive collaboration makes us a better business\nHuman Interest is an equal opportunity employer. All applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, veteran or military status, pregnancy, or any other characteristics protected under federal, state, or local laws.\nHuman Interest employees must adhere to the Company's security policies and Code of Ethics.\nPlease note Human Interest does not accept unsolicited resumes from any source other than directly from candidates. We will not consider resumes from vendors including and without limitation search firms, staffing agencies, fee-based referral services, and recruiting agencies. Pursuant to the San Francisco Fair Chance Ordinance, we will consider employment-qualified applicants with arrest and conviction records. We comply with CCPA guidelines. See more: https://humaninterest.com/disclosures"
  },
  {
    "company": "Bear Robotics",
    "title": "Software Engineer - 2022 Internship. In-Person",
    "company_url": "https://www.linkedin.com/company/bear-robotics-inc?trk=public_jobs_topcard-org-name",
    "location": "Redwood City, CA",
    "details": "Role: Software Engineer Intern\nLocation: Redwood City, CA or Dallas, TX\nType: Internship\nReports To: Director, Engineering\nJob Overview: We are looking for a Software Engineer Intern to join our growing team and help build out the next generation of our robots. The Software Engineer Intern will be responsible for researching, designing, building, and maintaining software and robotics systems and applications. To be successful as a Software Engineer Intern you should be technically oriented and enjoy solving complex challenges. Ultimately, a top-notch Software Engineer Intern should be innovative, open-minded, and an excellent troubleshooter.\nResponsibilities And Duties\nYou are involved in building and optimizing our own Bear Operating Systems, an infrastructure to control and monitor our globally deployed robots. You are building the remote monitoring, record-replay as well as resource scheduling.\nWhen it comes to distributed computing, you lead the way in your team and are the go-to expert in regard of system design and architecture. No matter if it is backend or frontend - you own the system full stack like no other. Furthermore, you enjoy driving optimization strategies and realizing ambiguous workstreams.\nYour organization skills, go-getter personality, and people-focused mentality are the right tools to grow into a tech lead role.\nQualifications\nIn pursuit of Bachelors, Master's, or Ph.D. degree in Computer Science or related field.\nExperience with coding in C, C++, Java, JavaScript, Python, Go, or another relevant programming language.\nExperience working in Unix/Linux environments.\nExperience with data structures, algorithms and software design.\nAbility to work on projects related to mobile development, robotics, distributed and parallel systems, machine learning, networking, and/or security software development, preferred.\nAbility to showcase tech projects and participate in computer science-related extracurricular activities, preferred.\nAbout Us\nOur company was founded in 2017 and has developed a robot that autonomously shuttles food from the kitchen out to customer tables and then brings dishes back for cleaning.\nA start-up gives you the chance for personal development and building up expertise in your field while providing opportunities for cross-functional growth. We’re not a big tech company yet, but we’re striving every day to be THE global player when it comes to hospitality robotics. We have deployed to several enterprise customers and are on the cusp of mass manufacturing our robots for the world to use.\nWe are ~150 motivated people who work hard to make our robots a reality, which can mean occasional extra hours and last-minute improvements. We will challenge you to walk the extra mile, pick your brain until it smokes and make you think outside of the box, but we would also like to hang out with you, have an after-work drink together and celebrate your successes.\nWe provide excellent benefits, including comprehensive health coverage, lunch every day, remote work flexibility, internet and phone reimbursement, and employee bonus programs.\nIf you feel you’re ready for a professional adventure in robotics, we would love to hear from you. Please send us your resume with a short overview of yourself with salary expectations and why this role is perfect for you."
  },
  {
    "company": "Redfin",
    "title": "Software Engineer Intern. Remote",
    "company_url": "https://www.linkedin.com/company/redfin?trk=public_jobs_topcard-org-name",
    "location": "Seattle, WA",
    "details": "Redfin (Nasdaq: RDFN) is revolutionizing the $75 billion real estate industry. We use data, beautiful software, and innovative design to put customers first at every step in the home-buying and selling process. Get ready to dive headfirst into our award-winning website and mobile apps, solving complex business problems in a highly visible, customer-centric way. If you value doing great work in a collaborative environment, join our team!\nAs a Software Developer intern, you'll use your technical skills to empower millions of our users, including customers and real estate agents, with the latest end-to-end technology. We are looking for eager full-stack developer(s) to work on technology that brings previously unimaginable ease and simplicity in real estate transactions for home buyers and sellers.\nThe Role\nUse tools and technology across all layers of the development stack, from Java, JavaScript, React, and React Native, to Kafka, to Kubernetes, and use different cloud technologies to build engaging, intuitive web and mobile experiences for home buying and selling homes\nTackle complex technical problems that reach across the company, learning about every part of the business\nGet exposure to all levels of the company and a management team invested in your growth and success\nDesired Skills & Experience\nPursuing a Bachelor's, Master's, or Ph.D. degree in engineering, computer science, or related field with at least one semester/quarter remaining after internship\nKnowledge of one or more software development languages (Java, C++, JavaScript, Python, Objective-C, Swift, Ruby, etc), CS fundamentals, algorithms, and data structures\nThe ability to deal with ambiguity, communicate well with partner teams - both technical and non technical, and a strong empathy for the customer experience\nYou’re a full-stack developer who can crank out rock-solid code\nYou think like an end user and crave simple, beautiful interfaces\nWhat We Offer\nSupport and resources to continue learning, a brilliant team with which to collaborate, and a commitment to your career so you can grow with the company under a management team that has experience building startups into profitable, publicly traded companies\nFar more responsibility than at a big company, while at the same time far less stress than you will find in a 2-person startup\nThe fruits of your labor are released every day and you'll share in our joy as we hear back from customers and national media\nA well-defined career ladder and management support to help grow your career.\nCompetitive compensation packages with a salary, bonuses, restricted stock grants, and generous benefits\nRedfin is an equal opportunity employer committed to hiring a diverse workforce.\nTo ensure the health and safety of our workforce, customers and third parties, Redfin conducts background screening after making conditional offers for employment. All screening is conducted consistent with Equal Employment Opportunity Commission guidance and state and local Fair Chance Act guidance, and Redfin encourages applications from, and fully considers, qualified applicants with criminal record histories."
  },
  {
    "title": "Intern, User Interface Designer. In-Person",
    "company": "SMS Assist, L.L.C.",
    "company_url": "https://www.linkedin.com/company/sms-assist-llc?trk=public_jobs_topcard-org-name",
    "location": "Chicago, IL",
    "details": "At SMS Assist, we’re not just in the business of fixing properties—we’re fixing an entire industry. Through our award-winning technology platform, built and powered by SMSers, we connect local contractors to our customers and help manage an experience that surpasses expectations.\nRecognized on Forbes’ Cloud 100 list, Deloitte’s Technology Fast 500, Chicago Crain’s Top Tech Employers, and more, SMS Assist manages more than 200,000+ properties where people live and work.\nWe’re innovators, disruptors, and out-of-the-box thinkers. We want to make every property better, and we want your help to make it happen.\nThe SMS Assist Summer Internship program is a full-time, paid opportunity that will run this summer, usually a 10-week internship program that runs June through August. An internship at SMS Assist will provide an opportunity to work with a fast-paced, growing company in Chicago’s vibrant technology scene.\nEach intern in our summer group goes through one week of training together as a cohort and are placed in one of our departments, where they’ll spend around 75% of their time throughout the summer. The other 25% is spent engaging in intern-specific activities and learning opportunities, such as executive lunch & learns, personal development workshops, and access throughout the company for informational interviews.\nDuring the internship, the program interns will work together on an SMS Assist business case, and they will present their findings and ideas at the conclusion of the internship for SMS Assist leadership and other key team members. Of course, we have some fun social events thrown in there as well!\nSMS Assist’s vision is to make every property better. We serve more than 200,000 commercial and residential properties nationwide. We connect property owners in industries like retail and restaurant with a dense affiliate network that specializes in more than 55 trades like landscaping, plumbing, HVAC, and more. Our customer service organization leverages our proprietary One by SMS Assist cloud platform to process thousands of work orders on a daily basis.\nEvery day we strive to provide the best service to our customers through an entrepreneurial spirit, a passion for service, teamwork, and integrity. We offer a game room, fitness center, bike garage, SMS Serves philanthropy program, company events, a fun location along Chicago’s Magnificent Mile, and more. SMS Assist is a Moxie Awards winner, Chicago Innovation Awards winner, a Top 100 Digital Company in Chicago and has been named to the Forbes Cloud 100 list for all four years of its existence! The list ranks the top 100 private cloud companies across four factors: market leadership, estimated valuation, operating metrics, and culture.\nJob Summary - User Interface Designer Intern\nThe User Interface Designer Intern works closely with Product scrum teams to deliver high-quality visual designs of product experiences that adhere to brand guidelines, follow our design system, and meet both accessibility requirements user needs. As part of our user experience team, a UI Designer Intern is expected to collaborate with UX architects, product managers, developers, and stakeholders to contribute to the definition and creation of human-centered design solutions that address customer needs and meet SMS Assist's business goals. You will have the opportunity to participate in multiple aspects of the UX lifecycle (research, concepting, iterative design, usability testing) and learn how we deliver value.\nThe User Interface Designer Intern participates in these areas of UX discipline:\nUser Research\nUsability Testing\nCurating of design system\nDocumenting design for developers\nCreation of prototypes\nParticipating in Ideation/Brainstorming\nResponsibilities - User Interface Designer Intern\nDesign elegant, smart, and usable designs for web and mobile applications\nSupport human-centered design approach through rapid testing and iteration of concepts\nSupport consistency across application experiences through application of design system and UX patterns\nParticipate in design thinking methodologies to empathize, learn, ideate, challenge stakeholders and UX peers, and iterate\nParticipate in Agile process to deliver design artifacts in a timely and effective manner\nContribute to user research activities, gathering requirements, identifying opportunities, and helping prioritize product roadmaps\nWork with team members across time zones\nEnsure confidentiality of internal and external data\nMinimum Qualifications\nQualifications - User Interface Designer Intern\nHuman-Centered Design training\nExperience creating high-fidelity visual design and prototypes\nExperience facilitating usability testing\n­­­­­___________________________________________________________________________________\nPlease note, this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities, and schedule may change at any time with or without notice.\nSMS Assist is an Equal Opportunity Employer (EOE) that welcomes and encourages all applicants to apply regardless of age, race, color, religion, sex, sexual orientation, gender identify and/or expression, national origin, disability, veteran status, marital or parental status, ancestry, citizenship status, pregnancy or other reasons prohibited by law."
  },
  {
    "title": "UX Design Intern. Remote",
    "company": "Stride, Inc.",
    "company_url": "https://www.linkedin.com/company/stride-learning?trk=public_jobs_topcard-org-name",
    "location": "United States",
    "details": "Meet Stride\nSuccess Stories\nResponsibility and Inclusion\nOver 20 years ago, Stride was founded to provide personalized learning — powered by technology. We reached students where they were in their own journeys. We knocked down their barriers to great education. And we gave every learner equal opportunity to succeed — however they defined success. Stride innovated the learning experience with online and blended learning that prepared them for their lives ahead.\nStride is a community of passionate leaders. Whether teachers, engineers, curriculum writers, or financial managers — whatever your expertise or role, we all work to empower futures through learning. And changing the trajectory of learning itself is one of our greatest missions. Join us in developing more effective ways to learn and helping learners build the skills and confidence they need to make their way forward in life.\nInterns hired for this position will assist with multiple projects within K12’s Product Development - User Experience Design team. They may also assist with the design system site for documenting and sharing design styles and patterns. Interns will also be introduced to the agile methodology.\nESSENTIAL FUNCTIONS: Reasonable accommodations may be made to enable individuals with disabilities to perform the essential duties.\nCreate Sketch libraries and pattern pages for the design system;\nUnderstand user needs and business goals to inform product feature designs;\nCreate flow diagrams, wireframes, interactive prototypes, and UI specifications that adhere to accessibility and mobile-ready guidelines and maintain design consistency and coherence across product;\nPrepare materials for usability test sessions;\nTake notes during usability test sessions.\nSupervisory Responsibilities: This position has no formal supervisory responsibilities.\nMinimum Required Qualifications\nCurrent or recently graduated student pursuing a BS/BA or MS/MA degree in Human-Computer Interaction, Applied Learning Sciences and Education Technology, Human Factors, Product Design, or a related field OR\nEquivalent combination of education and experience\nCertificates and Licenses: None required.\nOther Required Qualifications\nDetail-oriented and organizational skills\nExcellent communication and collaboration skills\nObservational and listening skills\nSelf-motivation and excellent problem-solving skills\nPassionate about creating well-designed products for education\nAbility to listen effectively, respect others’ perspectives and contributions, and offer and accept constructive feedback\nExperience with user-centered research methods a plus.\nExperience with one or more UX design and prototyping tools, such as Sketch, Figma, Invision etc. a plus.\nFront-end coding in HTML/CSS and javascript a plus.\nPortfolio is required.\nProficiency in Microsoft Excel, Power Point, MS 365; Web proficiency\nAbility to clear required background check\nWORK ENVIRONMENT: The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nThis is a home-based position and open to residents of the 50 states and D.C.\nCompensation & Benefits: Stride, Inc. considers a person’s education, experience, and qualifications, as well as the position’s work location, expected quality and quantity of work, required travel (if any), external market and internal value when determining a new employee’s salary level. Salaries will differ based on these factors, the position’s level and expected contribution, and the employee’s benefits elections. Offers will typically be in the bottom half of the range.\nWe anticipate the salary range to be $19.50 to $29.26 per hour. Eligible employees may receive a bonus. This salary is not guaranteed, as an individual’s compensation can vary based on several factors. These factors include, but are not limited to, geographic location, experience, training, education, and local market conditions. Stride offers a robust benefits package for eligible employees that can include health benefits, retirement contributions, and paid time off.\nThe above job is not intended to be an all-inclusive list of duties and standards of the position. Incumbents will follow any other instructions, and perform any other related duties, as assigned by their supervisor. All employment is “at-will” as governed by the law of the state where the employee works. It is further understood that the “at-will” nature of employment is one aspect of employment that cannot be changed except in writing and signed by an authorized officer."
  },
  {
    "title": "UX Design Intern. In-Person",
    "company": "Spatial",
    "company_url": "https://www.linkedin.com/company/spatial-systems?trk=public_jobs_topcard-org-name",
    "location": "New York, NY",
    "details": "Who We Are\nSpatial is a venture-backed VR and web platform for creating one-click NFT galleries and exhibitions that bring people together. As a metaverse for culture, we offer the most beautiful and accessible platform, where creators, collectors, and brands can host an immersive experience for members of their community.\nSpatial was selected as one of the most innovative companies by FastCompany in 2021. We were on the keynote stage with Microsoft’s CEO twice in 2019 and were recently featured in The Wall Street Journal, Wired, The Verge, Hypebeast and Input. We are grateful to have raised funding from leading investors including the founders of Instagram and Uber, and have deep partnerships with leaders in the space, including OpenSea, SuperRare, the Hermitage, the Utah Jazz, WhaleDao, and more.\nWe are a passionate team of 3D Design and AR/VR experts based in New York and San Francisco, and are currently hiring.\nYour Duties\nDesign user interface and UX flow for collaborative AR experience.\nCreate compelling visual and motion design language for 2D / 3D UIs.\nCreate visual assets including 2D images, 3D models, and UI layout.\nCreate compelling marketing materials including videos and website.\nRequirements\nMinimum Qualifications:\nStrong portfolio or reel of interaction, product, visual, or motion design examples.\nStrong sense of aesthetics and understanding of visual design.\nProficient in design tools (Figma, Adobe Suites)\nProficient in video editing (Premiere, After Effects, Final Cut Pro)\nPreferred Qualifications:\nStrong 3D & motion skills (Cinema 4D, After Effect).\nExperience in 3D Modelling (Maya, 3D Max)\nExperience in designing UI/UX for software products.\nBenefits\nWages and Benefits\nPlease send resumes and links to past work (applications without project/work links will not be considered). Internship is full-time, based in New York City or San Francisco* and includes a competitive wage. Relocation assistance will be provided if necessary.\nMay be fully remote due to Covid"
  },
  {
    "title": "Intern Program – UI Designer. In-Person",
    "company": "Epsilon",
    "company_url": "https://www.linkedin.com/company/epsilon?trk=public_jobs_topcard-org-name",
    "location": "Chicago, IL",
    "details": "Job Description\nEpsilon is seeking a User Interface (UI) Designer Intern who is interested in a career in interaction design, web design, or visual digital interfaces. You will collaborate closely with the UI team to design and implement Internet solutions for our clients, delivering premier, creative, entertaining, high-volume, high-visibility, enterprise-scale websites.\nAs an intern you’ll participate in a formal Intern Program, which is an 11-week summer program that aims to create a meaningful early career experience for university students. The program offers professional development & hands-on training, networking opportunities with people throughout the business including multiple projects & social events, and the consideration for full-time employment.\nResponsibilities May Include (All Or Some) Tasks Below\nSupport the visual design of all interactive and website applications by producing UI concepts and updating visual design interactions for existing web components\nCreate effective visual screen designs that communicate user information and interaction goals based on UX wireframes and requirements\nSupport the creation of project deliverables with multiple UI concepts and solutions\nBrainstorm new creative ideas and solutions with UI team\nProvide visual interactive concepts and animations for web components\nQualifications\nCandidate for Bachelors with a concentration in UI Design, Human/Computer Interaction, Web/App Design, Interactive Media, Graphic Design or similar\nProficient with Adobe Creative Suite (Illustrator, Photoshop, After Effects, etc.)\nFamiliar with UI Tools and design systems such as Adobe XD, Figma, Sketch, & Invision, a plus\nMust have a portfolio to showcase previous projects (Behance, Dribbble, personal website, etc. Please no PDFs)\nExposure to visual design and digital interaction theory\nExposure to HTML, CSS, JS a plus\nHighly organized with great attention to detail\nExcellent listening & communication skills, both verbal and written\nAble to multi-task and prioritize in a fast-paced environment\nAble to work in a team & build effective relationships\nSelf-starter, with strong initiative\nAdditional Information\nWhen you’re one of us, you get to run with the best. For decades, we’ve been helping marketers from the world’s top brands personalize experiences for millions of people with our cutting-edge technology, solutions and services.\nThanks to the work of every employee, Epsilon products and services have been recognized as industry-leading by the Forrester Wave™. We process more than 500 billion consumer actions each day and hold many patents of proprietary technology, including real-time modeling languages and consumer privacy advancements. And our CORE ID® is the industry’s most accurate, stable and scalable identity solution that helps brands recognize and reach 200M+ U.S. consumers in a privacy-safe way.\nPositioned at the core of Publicis Groupe, Epsilon is a global company with more than 8,000 employees around the world. For more information, visit epsilon.com\nGreat People Deserve Great Benefits\nWe know that we have some of the brightest and most talented associates in the world, and we believe in rewarding them accordingly. If you work here, expect competitive pay, comprehensive health coverage, and endless opportunities to advance your career.\nEpsilon is an Equal Opportunity Employer. Epsilon’s policy is not to discriminate against any applicant or employee based on actual or perceived race, age, sex or gender (including pregnancy), marital status, national origin, ancestry, citizenship status, mental or physical disability, religion, creed, color, sexual orientation, gender identity or expression (including transgender status), veteran status, genetic information, or any other characteristic protected by applicable federal, state or local law. Epsilon also prohibits harassment of applicants and employees based on any of these protected categories.\nEpsilon will provide accommodations to applicants needing accommodations to complete the application process.\nREF142869R"
  },
  {
    "title": "UX Design Intern. Remote",
    "company": "Perkins&Will",
    "company_url": "https://www.linkedin.com/company/perkins-will?trk=public_jobs_topcard-org-name",
    "location": "Chicago, IL",
    "details": "We are looking for a UX design intern to work closely with our design and development teams. You will have the opportunity to research spatial and digital products that will be used by our clients and employees. We are seeking candidates with strong design backgrounds and the ability to create intuitive, intelligent, and enriching user experiences.\nThe ideal candidate can make sense of complex workflows and turn them into elegant, intuitively designed solutions. Our interns work closely with our designers to bring innovative and creative design ideas to the table.\nWhat We’re Looking For:\nBachelor's or graduate degree in a related field.\nProficiency in Figma, Zeplin, or other visual design and wire-framing tools.\nFamiliarity with one or more of these languages is a plus, though not required: HTML, SQL, CSS, and JavaScript for rapid prototyping.\nExcellent visual design skills with sensitivity to user-system interaction.\nDemonstrable UI/UX design skills with a strong portfolio.\nExcellent verbal and written communication skills and an ability to present your designs.\nAn understanding of the latest interface design patterns in Material Design and iOS design.\nThe ability to solve problems creatively, iteratively, and effectively. Website portfolio is required.\nAt Perkins&Will we believe that inclusion spurs creativity, and that innovation is born from an engaged culture of diverse people + ideas. By moving beyond barriers and stereotypes of gender, race, color, religion, national origin, ancestry, age, medical condition, disability, sexual orientation, gender identity, veteran status; we are committed to building an organization that reflects the diversity of the communities and clients we serve\nCOVID-19 VACCINATION POLICY\nThe safety of all employees is a priority during COVID and we presently require everyone to be fully vaccinated to enter our studio or attend in-person client meetings or visit job sites. No waiver of requirement that the position advertised includes the capacity to be present in the studio is expressly or impliedly waived."
  },
  {
    "title": "Intern Program – UI Designer. In-Person",
    "company": "Publicis Groupe",
    "company_url": "https://fr.linkedin.com/company/publicis-groupe?trk=public_jobs_topcard-org-name",
    "location": "Chicago, IL",
    "details": "Epsilon is seeking a User Interface (UI) Designer Intern who is interested in a career in interaction design, web design, or visual digital interfaces. You will collaborate closely with the UI team to design and implement Internet solutions for our clients, delivering premier, creative, entertaining, high-volume, high-visibility, enterprise-scale websites.\nAs an intern you’ll participate in a formal Intern Program, which is an 11-week summer program that aims to create a meaningful early career experience for university students. The program offers professional development & hands-on training, networking opportunities with people throughout the business including multiple projects & social events, and the consideration for full-time employment.\nResponsibilities May Include (All or Some) Tasks Below:\nSupport the visual design of all interactive and website applications by producing UI concepts and updating visual design interactions for existing web components\nCreate effective visual screen designs that communicate user information and interaction goals based on UX wireframes and requirements\nSupport the creation of project deliverables with multiple UI concepts and solutions\nBrainstorm new creative ideas and solutions with UI team\nProvide visual interactive concepts and animations for web components\nQualifications:\nCandidate for Bachelors with a concentration in UI Design, Human/Computer Interaction, Web/App Design, Interactive Media, Graphic Design or similar\nProficient with Adobe Creative Suite (Illustrator, Photoshop, After Effects, etc.)\nFamiliar with UI Tools and design systems such as Adobe XD, Figma, Sketch, & Invision, a plus\nMust have a portfolio to showcase previous projects (Behance, Dribbble, personal website, etc. Please no PDFs)\nExposure to visual design and digital interaction theory\nExposure to HTML, CSS, JS a plus\nHighly organized with great attention to detail\nExcellent listening & communication skills, both verbal and written\nAble to multi-task and prioritize in a fast-paced environment\nAble to work in a team & build effective relationships\nSelf-starter, with strong initiative\nAdditional Information\nWhen you’re one of us, you get to run with the best. For decades, we’ve been helping marketers from the world’s top brands personalize experiences for millions of people with our cutting-edge technology, solutions and services.\nThanks to the work of every employee, Epsilon products and services have been recognized as industry-leading by the Forrester Wave™. We process more than 500 billion consumer actions each day and hold many patents of proprietary technology, including real-time modeling languages and consumer privacy advancements. And our CORE ID® is the industry’s most accurate, stable and scalable identity solution that helps brands recognize and reach 200M+ U.S. consumers in a privacy-safe way.\nPositioned at the core of Publicis Groupe, Epsilon is a global company with more than 8,000 employees around the world. For more information, visit epsilon.com\nGreat People Deserve Great Benefits\nWe know that we have some of the brightest and most talented associates in the world, and we believe in rewarding them accordingly. If you work here, expect competitive pay, comprehensive health coverage, and endless opportunities to advance your career.\nEpsilon is an Equal Opportunity Employer. Epsilon’s policy is not to discriminate against any applicant or employee based on actual or perceived race, age, sex or gender (including pregnancy), marital status, national origin, ancestry, citizenship status, mental or physical disability, religion, creed, color, sexual orientation, gender identity or expression (including transgender status), veteran status, genetic information, or any other characteristic protected by applicable federal, state or local law. Epsilon also prohibits harassment of applicants and employees based on any of these protected categories.\nEpsilon will provide accommodations to applicants needing accommodations to complete the application process.\nREF142869R"
  },
  {
    "title": "UX Design Intern. In-Person",
    "company": "Q2",
    "company_url": "https://www.linkedin.com/company/q2software?trk=public_jobs_topcard-org-name",
    "location": "United States",
    "details": "Q2 is looking for talented individuals with exceptional technical curiosity and is enthusiastic about solving problems.\nThe Summer Internship Program is 12-weeks long (May 24th - August 12th) and all positions are paid hourly with an average work week of 40 hours. In addition to your daily work, you will be given the opportunity for weekly classroom trainings with Sr. Leadership, activities with other Q2 interns and the opportunity to present to the Executive Leadership team at the end of the program. This position will be remote role.\nAs a UX Design Intern You Will\nReceive real-world, hands-on experience with software design projects that support our financial institutions.\nSupport other designers with research efforts, design prototyping, and documenting user experience design work.\nLearn from a collaborative team of seasoned User Experience Designers and gain exposure to other teams within our software company, including User Research, Product Management, and Development.\nConnect with our customers to better understand user needs.\nLearn industry design and prototyping tools like Axure and Sketch.\nHave multiple opportunities to practice their presentation skills\nResponsibilities For This Position Include\nAssisting other designers in producing UX deliverables including site maps, concept maps, process flows, wireframes, basic prototypes, and UI designs\nParticipating in user research, including user interviews, user testing, surveys. and contextual inquiries; work with other designers to produce professional research reports\nDocumenting and applying established UI patterns to prototypes and mockups to ensure consistency across products\nEffectively collaborating with other designers and project team members\nDelivering presentations of ideas and concepts to small project teams\nEnsuring that all security, availability, confidentiality, and privacy policies and controls are adhered to.\nMajor: Graphic Design, Information Architecture, HCI or related field\nClass: Undergraduate\nGraduation Date: May 2023 (rising senior) May 2024 (rising junior)\nRequirements\nGood written and verbal communication\nExcellent Microsoft products (excel, word, PPT) a must.\nFamiliar with Adobe Creative Suite, prototyping and wireframing software (such as Axure and Sketch)\nFamiliar with information architecture tools and techniques including site maps, concept maps, and process flows\nSome knowledge of best practices in usability\nAttention to detail and an aesthetic sensibility\nClear written and verbal communication skills\nAbility to collaborate well with teammates in multiple roles\nProficiency in the Microsoft Office Suite, including Word, PowerPoint, and Excel\nExperience with HTML and CSS a plus\nAt Q2, our goal is to be a diverse and inclusive workforce that fosters mutual respect for our employees and the communities we serve. Q2 is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status."
  },
  {
    "title": "UX Design Intern. Remote",
    "company": "iCrossing",
    "company_url": "https://www.linkedin.com/company/icrossing?trk=public_jobs_topcard-org-name",
    "location": "Chicago, IL",
    "details": "Job Description\nUX Design Internship\niCrossing looking for a UX Design Intern with a strong interest and passion for designing engaging user experiences on the web and or mobile devices. Our ideal candidate is currently or has recently completed education in User Experience, Product Design or a similar design or research program. They must be a self-motivated individual with a willingness to learn and contribute and be ready to absorb tons of knowledge!\nWhy Work for iCrossing?\nAt iCrossing, we inspire our design teams to create experiences that delight people and drive business outcomes through the activation of the agency’s strategic, experience, media and technology approaches. Also, our internships are paid opportunities. You’ll work with experts in the field to imagine and design experiences for some of the world’s best brands.\nWhile Working With Us You Will Have Access To\nA creative, collaborative, and inclusive company culture\nIncredible networking opportunities\nOpportunities to develop professionally, uncovering research and design skills you didn’t know you had\nSupport the UX team in providing consistent service and design for our clients\nQualifications\nMust be currently pursing or recently graduated (proof of enrollment or graduation will be required if selected for an internship)\nCurrently pursing or recently graduated (in past six months) from a program focused on Graphic Design, Digital Design, User Experience Design, Human Computer Interaction (HCI), or related field from an accredited college, university or design program.\nMust have at least a 3.0 GPA or equivalent grade in program\nMust be able to travel into our Chicago office in Fulton Market at various times.\nExperience working with design tools such as Figma, Sketch, Miro, and the Adobe Creative Suite.\nPassion for design, ideation, and collaboration\nResponsibilities\nAssist with discovery research activities such as tree testing, usability studies, customer interviews, competitive research, and more\nTake part in design and customer journey mapping workshops\nSupport the UX Design team by creating user flows, concepts, wireframes, and light prototypes"
  },
  {
    "title": "2022 Summer Intern: UX Designer. In-Person",
    "company": "Walmart",
    "company_url": "https://www.linkedin.com/company/walmart?trk=public_jobs_topcard-org-name",
    "location": "Bentonville, AR",
    "details": "Requirements\nPosition Summary... What you'll do...\nGraduation Dates of Focus: Between Dec 2022 – June 2023\nInternship Date: May 31, 2022- August 12, 2022\nThe Sam's Club/Walmart Experience Design team crafts compelling experiences wherever we meet our members, customers and associates—from our clubs, stores, to their businesses, and to their homes. We creatively deliver impact for the web, apps, in-club/store experiences and associate-facing tools.\nAs a UX Design intern, you will help transform complex information and tasks into easy-to-use designs for our millions of members and associates. To do this, you’ll need to think visually –using techniques like storyboards and sketching –to communicate design concepts. You’ll use your knowledge of the UX process (research, conceptual design, prototyping, testing, etc.), in collaboration with other team members, to iterate solutions and deliver compelling designs.\nHow you’ll spend your days\nCreating business, consumer, and associate product experiences\nWorking alongside talented and passionate senior designers and managers\nLearning to think holistically – about the people using our products, a cohesive design system, and end-to-end experiences\nMaking design decisions based on good judgment, solid research and data\nWhy you’re a great fit\nYou’re probably stronger on one side than the other, but you have a blend of interaction and visual design skills, and an eye for detail\nYou have tons of ideas about how to create a better experience for customers and employees, and you’re excited to tell us about them\nYou have a constant drive to stay up to date with the latest industry news and developments\nYou’re a creative problem solver who leans into collaboration to create delightful experiences\nSkills you’ll have\nYou are articulate and can communicate why you made design decisions\nYou understand user interface standards and conventions, functional communication flows and dynamic, engaging interfaces\nYou have a strong understanding of design theory and concepts to create effective visual communication with hierarchy and balance (typography, color, space, contrast)\nYou can work with design templates and patterns to maintain a scalable and consistent website\nYou have the ability to produce great work in short timeframes and multi-task across priorities\nYou have some experience with gathering business requirements, site assessment, competitive analysis, and secondary research\nAvailable Locations:\nDallas, TX / Bentonville, AR / Sunnyvale, CA / San Bruno, CA\nMinimum Qualifications...\nOutlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications.\nAs permitted by applicable law, provide evidence of full vaccination as defined by CDC guidelines OR secure approval of medical or religious accommodation for the vaccination mandate., Bachelor Degree OR 1 year design experience Preferred Qualifications...\nOutlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications.\neCommerce, Web design, user interface design, or related field, Web production experience Primary Location...702 SW 8TH ST, BENTONVILLE, AR 72716, United States of America"
  },
  {
    "title": "UX Design Intern. In-Person",
    "company": "Leidos",
    "company_url": "https://www.linkedin.com/company/leidos?trk=public_jobs_topcard-org-name",
    "location": "Charlotte, NC",
    "details": "Description\nJob Description:\nLeidos is seeking a local area student to join our growing team in Morgantown, WV as a User Experience (UX) Design Intern. This is a remote position but if the candidate is in Morgantown WV, Reston VA, Charlotte NC, or Charlottesville VA, they are welcome to go into the office. You will support our design process throughout the planning and software development lifecycle for a multitude of unique user interfaces (UI). You will also work collaboratively with other UX team members, software engineers, domain experts, and executives to meet objectives and provide innovative solutions.\nPrimary Responsibilities\nWork closely with the UX team to develop creative solutions for a wide variety of user experience challenges.\nProposedesign direction and help define style guides and content strategy.\nUse industry standard tools to create UI wireframes and interactive prototypes.\nAttend project meetings to take notes and understand requirements.\nPresent design work to the customer, engineering team, product team, and executives for review and feedback.\nBasic Qualifications\nPursuing a Bachelor's degree in visual communication, graphic design, UX, human-computer interaction (HCI), or related field with minimum 3.0 GPA\nPortfolio with samples of graphic and layout design (e.g., website designs, illustrations, storyboards, wireframes, UIs, etc.)\nExcellent communication, presentation, and storytelling skills\nAbility to work in a collaborative, multi-disciplinary environment\nDesire to work in a start-up style environment, where iteration is encouraged\nPreferred Qualifications\nExperience with Adobe Creative Cloud\nExperience with Figma\nExperience with prototyping tools such as Axure, InVision, and Miro\nKnowledge of responsive web design concepts\nKnowledge of basic HTML and CSS\nPay Range\nPay Range $38,400.00 - $52,000.00 - $65,600.00"
  },
  {
    "title": "Digital Designer Intern. In-Person",
    "company": "Iris",
    "company_url": "https://uk.linkedin.com/company/iris?trk=public_jobs_topcard-org-name",
    "location": "Chicago, IL",
    "details": "Location: Chicago, IL\nThe Opportunity\nAre you a creative individual who loves all things digital and thinks in pictures and pixels?\nIf you speak that language, then you have found your people.\nAt Iris, we live by participation across 14 offices. From amazing ideas to cut through insights, when people across our network find what they can change and make it happen, we come into our own. We are inviting you to participate in progress – moving yourself and the world forward with every decision you make. We are looking for a Digital Designer Intern for our Summer 2022 Internship Program that will be working alongside our team of creatives to collaborate with the best and brightest in the world—all while helping to create world-class creative outputs that transform the complex into beautifully simple creative solutions.\nSkills/Requirements\nPursuing a bachelor's degree or above in a design-related field\nPursuing a career at an advertising/marketing agency, design studio, internal marketing department, or other relevant business\nA portfolio showcasing a range of work in digital design and demonstrating a solid understanding of design principles and web design best practices\nA strong understanding of grid systems and responsive design, and an immaculate sense of layout, spacing, visual flow, typography and color theory\nProficiency in design tools like Adobe Creative Suite, Figma and Sketch\nIllustration, animation, motion graphics and coding experience is considered a huge plus\nKnowledge of Microsoft Office Suite, with proficiency in PowerPoint\nCurious and open-minded with a growth mindset who thrives on continuous learning\nPersonal motivation and drive to get things done in a dynamic, rapid growth environment\nResponsibilities\nWork on a wide range of deliverables that range from creating a new brand identity to developing a design system, executing integrated marketing campaigns, and crafting experience design journeys that include wireframes, user flows, interactive prototypes, and pixel-perfect visual assets for web and mobile\nAbility to manage a project from concept through production, across multiple media\nTranslate marketing strategy into persuasive layouts, concepts and brands\nDeveloping strategic and cohesive brand experiences for companies across their digital platforms (website, mobile, email, social, etc.) while collaborating with cross-functional teams\nContribute to a creative, supportive culture while collaborating with cross-functional teams across multiple digital channels\nKeen awareness of trends in digital media, branding and the integrated marketing space\nExcellent communication skills to be able to present ideas internally and externally, clearly and confidently\nStrong understanding of customer experience and working with multiple touchpoints across multiple channels within campaign platforms\nSet a high bar for digital storytelling that consistently engages our audiences\nParticipate in and facilitate group brainstorms\nAbout Our Internship Program\nThis is NOT a coffee-run and making copies internship! Interns will work alongside the rest of our team, attend meetings, and will be fully immersed in day-to-day agency life.\nInterns will work closely with their manager and colleagues and will contribute to the work the team is doing for clients.\nInterns will complete one group project for the program to be presented at the end of the 8 weeks\nInterns will attend weekly Lunch & Learns led by our team members\nDates: June 13 – August 5 (8 weeks)\nCompensation: $15/hour\nThe internship will be a hybrid of in-office days and WFH days.\nAbout Iris\nBack in 1999, Iris was founded by a team of six people around a single client. Those six founders are still at the very heart of our business. Today, Iris is a thriving micro-network of over 1,000 people in 14 locations across the globe. We deliver a multitude of fully integrated specialisms within creative, consulting and mar-tech to some of the most progressive clients around the world.\nWe are part of the Cheil Worldwide network – the world’s 15th biggest creative agency company. Our partnership with Cheil has allowed us to extend our global to a network of 55 offices.\nWe are ‘For the Forward’. Always exploring. Restless. Never done. Radiators of positive energy that serve to motivate. Empowering and supporting others to find opportunity.We liberate ourselves by removing the barriers that stand in the way of progress. Confident, bold, decisive and at times challenging. We stretch what’s possible.Always asking ‘What will move us Forward?’\nWe are proud to be an equal opportunities employer and recruit on talent alone, regardless of age, ethnicity, religion, education, class, sexual orientation or disability. We champion diversity and believe it not only benefits but enhances our creativity, our company and the wider society at large. We are For The Forward."
  }
]
