{
  "name": [
    {
      "company": "Ekata, a Mastercard company",
      "company_url": "https://www.linkedin.com/company/ekataglobal?trk=public_jobs_topcard-org-name",
      "location": "Seattle, WA",
      "details": "Description\nOur Purpose\nWe work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion (https//www.mastercard.us/en-us/vision/who-we-are/diversity-inclusion.html) for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results.\nOverview\nThe Cyber and Intelligence Solutions (C&I) team is responsible for product management and innovative product development of products and services to address the evolving risk & cyber security needs of all of MasterCard’s various customer segments. The C&I team was established with the responsibility to safeguard all aspects of safety and security in payments and have made great strides with new products, services and standards, positively impacting all aspects of our current and future payment eco-system.\nEkata, a Mastercard company, is the global standard in identity verification, providing businesses worldwide the ability to link any digital transaction to the human behind it. Our Ekata Identity Engine, the first and only of its kind, uses complex machine learning to combine features derived from the billions of transactions within our proprietary network and the data from our graph to deliver industry leading risk assessment solutions.\nWe are looking for a Software Engineering Intern to work in our Seattle office, who thrives on designing, coding, and maintaining high-performance data processing applications on the JVM platform (primarily in Clojure and Scala), running on AWS.\nYour ideal internship should be one where you work in a small team and are empowered to make yourself and your team more productive on a daily basis. You should want to be part of a team where your desire to grow and learn are valued and aptly rewarded; where using and contributing to open source are looked upon as an asset; where innovating and executing are core to your teams' beliefs.\nIn This Role You Will\nWrite performant code and write automated test to validate correctness of code\nDevelop and deploy large-scale microservices and/or data processing systems\nMeet development milestones and business requirements on schedule\nIndependently analyze, propose and develop solutions for technical problems and issues\nEnsure the adherence to the standards and procedures that result in an environment compliant with information security policy\nAll About You\nA willingness to learn new languages and techniques to solve challenging problems.\nExperience in functional programming fundamentals.\nBS degree in Computer Science, related degree or equivalent. Graduating before August 2023.\nAbility to write clean code that works, is readable, maintainable and follows best practices and coding standards\nUnderstanding of OO and functional design, languages, algorithms and data structures\nA philosophy of iteration and continuous improvement\nA desire to own design and architecture end to end\nCOVID-19 Considerations\nWe value the safety of each member of our community because we know we’re all in this together. In many locations, which may change over time, we’ve implemented a virtual hiring process and continue to interview candidates by video or phone. In addition, in some locations, only individuals who have been fully vaccinated will be permitted inside Mastercard offices until further notice.\nIn the US, Mastercard is a government contractor, which may legally require most Mastercard employees to be vaccinated unless a verified approved medical or religious exemption is granted. Further, we are currently making every effort towards having employees return to work in the office 2 days per week, if that makes sense for their team. Everyone must be vaccinated to enter Mastercard offices at this time. Therefore, we expect all candidates to be vaccinated or to be approved for a medical or religious accommodation prior to commencing work at Mastercard.\nIn the US, Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact [email protected] and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.\nCorporate Security Responsibility\nResponsibilities\nAll activities involving access to Mastercard assets, information, and networks comes with an inherent risk to the organization and, therefore, it is expected that every person working for, or on behalf of, Mastercard is responsible for information security and must\nAbide by Mastercard’s security policies and practices;\nEnsure the confidentiality and integrity of the information being accessed;\nReport any suspected information security violation or breach, and\nComplete all periodic mandatory security trainings in accordance with Mastercard’s guidelines."
    },
    {
      "company": "RM Talent Solutions",
      "company_url": "https://www.linkedin.com/company/rm-talent-solutions?trk=public_jobs_topcard-org-name",
      "location": "United States",
      "details": "About the Internship\nA client of RM Talent Solutions is looking to hire Python Developer Interns onto their team. Responsible for coding, designing, deploying, and debugging development projects, typically on the server-side (or back-end). They may, however, also help organizations with their technological framework.\nEligibility Criteria:\n• Undergraduate- Preferable Graduation Year is 2023 or later.\n• You are working towards a Bachelor's degree Computer Science.\n• Minimum GPA: 3.0 strongly preferred, may consider 2.7 and above.\n• Work Authorization: Applicants must be legally authorized for employment in the United States without the need for current or future employer-sponsored work authorization.\nJob Requirements:\n• Writing effective, scalable code\n• Developing back-end components to improve responsiveness and overall performance\n• Integrating user-facing elements into applications\n• Test and debug programs\n• Improve functionality of existing systems\n• Implement security and data protection solutions\n• Assess and prioritize feature requests\n• Coordinate with internal teams to understand user requirements and provide technical solutions\nApply now and we'll connect with you to explore your best matches!\""
    },
    {
      "company": "Amazon",
      "company_url": "https://www.linkedin.com/company/amazon?trk=public_jobs_topcard-org-name",
      "location": "Seattle, WA",
      "details": "Job Summary\nDESCRIPTION\nAmazon fall SDE internships are full-time (40 hours/week) for 12 consecutive weeks with start dates between August and September 2022. Applicants should have a minimum of one quarter/semester remaining in their studies after their internship concludes.\nAt Amazon, we hire the best minds in technology to innovate and build on behalf of our customers. The intense focus we have on our customers is why we are one of the world’s most beloved brands – customer obsession is part of our company DNA. Our interns write real software and collaborate with a select group of experienced software development engineers (SDEs) who guide interns on projects that matter to our customers.\nAs an intern, you will be matched to a manager and a mentor. You will have the opportunity to influence the evolution of Amazon technology and lead mission critical projects early in your career. Your design, code, and raw smarts will contribute to solving some of the most complex technical challenges in the areas of distributed systems, data mining, automation, optimization, scalability, and security – just to name a few.\nIn addition to working on an impactful project, you will have the opportunity to engage with Amazonians for both personal and professional development, expand your network, and participate in activities with other interns throughout your internship. No matter the location of your internship, we give you the tools to own your project and learn in a real-world setting. Many of our technologies overlap, and you would be hard pressed to find a team that is not using Amazon Web Services (AWS), touching the catalogue, or iterating services to better personalize for customers.\nKey Job Responsibilities\nCollaborate with experienced cross-disciplinary Amazonians to conceive, design, and bring innovative products and services to market.\nDesign and build innovative technologies in a large distributed computing environment, and help lead fundamental changes in the industry.\nCreate solutions to run predictions on distributed systems with exposure to innovative technologies at incredible scale and speed.\nBuild distributed storage, index, and query systems that are scalable, fault-tolerant, low cost, and easy to manage/use.\nAbility to design and code the right solutions starting with broadly defined problems.\nWork in an agile environment to deliver high-quality software.\nLocations\nBy applying to this position your application will be considered for all locations we hire for in the United States. This includes, but is not limited to:\nCA (Culver City, Cupertino, Irvine, Palo Alto, San Francisco, Santa Clara, Sunnyvale, Santa Barbara, Santa Cruz, Santa Monica)\nCO (Boulder, Denver)\nGA (Atlanta)\nMA (Boston, Cambridge, North Reading)\nNY (New York)\nTX (Austin)\nVA (Arlington, Herndon)\nWA (Bellevue, Seattle, Redmond)\n***Locations are subject to change.***\nIf this opportunity interests you, apply and come chart your own path at Amazon!\nBasic Qualifications\nCurrently enrolled in an Bachelor’s or Master’s Degree in Computer Science, Computer Engineering, Data Science, Electrical Engineering, or majors relating to these fields are considered with an expected conferral date later than 4/30/2023.\nProgramming experience with at least one modern language such as Java, C++, or C# including object-oriented design.\nPreferred Qualifications\nPrevious technical internship(s), if applicable.\nExperience with distributed, multi-tiered systems, algorithms, and relational databases.\nExperience in optimization mathematics such as linear programming and nonlinear optimization.\nAbility to effectively articulate technical challenges and solutions.\nAdept at handling ambiguous or undefined problems as well as ability to think abstractly.\nPursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\nPursuant to the Los Angeles Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.\nThe pay for this position in Colorado is $8,224/month. Fulltime interns working longer than 90 days will be eligible for access to a medical benefit, and can enroll in a 401k on Day 1 if age 18. Interns will also have access to paid time off. This information is provided per the Colorado Equal Pay Act. Base pay information is based on market location. Applicants should apply via Amazon's internal or external careers site.\nAmazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us.\nCompany - Amazon.com Services LLC\nJob ID: A2013931"
    },
    {
      "company": "RM Talent Solutions",
      "company_url": "https://www.linkedin.com/company/rm-talent-solutions?trk=public_jobs_topcard-org-name",
      "location": "Texas, United States",
      "details": "RM Talent Solutions is a platform that helps businesses grow and operate. RippleMatch is one of our clients which is a job matching platform that helps companies such as Texas Instruments, Anheuser-Busch, Siemens, eBay, and hundreds more recruit faster and with more convenience.\nWe are shaping the way college students find jobs and internships. We work with several top-tier companies, Fortune 500's, start-ups, and non-profits.\nWe use Artificial Intelligence which makes sure that companies find the best candidates for their job roles and students find the best positions where they get a higher chance to secure a job/internship than the traditional recruitment methods.\nIf you meet the below eligibility criteria, please apply and our recruitment team will connect with you to understand your strengths and strategize your career ahead.\nWe aim to build a strong connection with all of our applicants, so that we may help them achieve their career goals both today and in the future.\nEligibility Criteria:\nYour undergraduate graduation year is 2022 or later.\nYou are working towards a Bachelor's/Master’s/Ph.D degree.\nJob Requirements:\nYou have had exposure to coursework on subjects like distributed systems, concurrency control, data replication, file systems, or SQL processing.\nComfort using programming languages like Javascript, React, Redux, Go, C/C++, Java, and Python/Django. We use React.js, Redux, and Typescript on the client-side and use Go on the server side. If you don't know any of these languages, you'll learn them while you're here.\nYou love building relationships with your colleagues. You enjoy being part of the code review process and partnering with your teammates on challenging problems.\nTo apply for a Software Engineering Internship, candidates must meet the following requirements:\nMinimum GPA: 3.0 strongly preferred, may consider 2.7 and above.\nWork Authorization: Applicants must be legally authorized for employment in the United States without the need for current or future employer-sponsored work authorization.\nDesire to work within the United States.\nApply now and we'll connect with you to explore your best matches!"
    },
    {
      "company": "Astranis Space Technologies",
      "company_url": "https://www.linkedin.com/company/astranis?trk=public_jobs_topcard-org-name",
      "location": "San Francisco, CA",
      "details": "Astranis is connecting the four billion people in the world who do not currently have access to the internet. We are building the next generation of smaller, lower-cost spacecraft to bring the world online.\nWe are well-funded by some of the best investors in the business and have raised over $350 million to date. We are have a world-class team that is passionate about building amazing technology. And we have a fun and collaborative work environment where you will learn a lot and make a huge impact no matter where you are in your career. Just check out our Glassdoor reviews to see what our team has to say about working at Astranis.\nOur team is growing fast. Apply to be a part of our mission to connect the world!\nInternships at Astranis typically last for twelve weeks, and are hourly roles designed for students who are currently enrolled at a four-year university.\nAs an Intern, you will have an amazing opportunity to work on hard problems — we pride ourselves on giving everyone at Astranis a chance to do meaningful work on challenging projects, no matter their seniority. Many past interns have designed and tested hardware/software that is heading to space on our first satellite, and many of them are now full-time employees at Astranis.\nIf you have already graduated from a four-year university, please apply to be an Associate Engineer.\nRole\nDesign, build, and implement the ground software system for our spacecraft\nUse React to build the front end interface to our web application that enables safe, efficient, and elegant command and control of our satellite throughout its mission\nUse Django to build the backend for our commanding interface\nWork closely with satellite operators to understand how they would like to operate the spacecraft to inform software requirements\nCollaborate with multidisciplinary teams to define software requirements, architectures, and designs\nRequirements\nCurrently pursuing a B.S. or M.S. in Computer Science or equivalent technical degree\nObject-oriented: Python or other\nDemonstrated ability to design, write, and test software from scratch\nDon't meet them all? Not a problem. Please apply even if you do not meet all these criteria.\nBonus\nDatabase: SQL, NoSQL\nExperience with tools like Docker and load balancers for cloud resource provisioning, deployment, and management\nInter process communication\nU.S. Citizenship, Lawful Permanent Residency, Or Refugee/Asylee Status Required\n(To comply with U.S. Government space technology export regulations, applicant must be a U.S. citizen, lawful permanent resident of the United States, or other protected individual as defined by 8 U.S.C. 1324b(a)(3))\nOur mission and our products are meant to connect the world and everyone in it, regardless of gender, race, creed, or any other distinction. We believe in a diverse and inclusive workplace, and we encourage all people to join our team and bring their unique perspective to help make us stronger."
    },
    {
      "company": "PeachPay: One-Click Checkout",
      "company_url": "https://www.linkedin.com/company/peachpay?trk=public_jobs_topcard-org-name",
      "location": "Ames, IA",
      "details": "About PeachPay\nPeachPay is a technology startup on a mission to supercharge ecommerce checkout and payments. We bring a sleek, modern checkout experience to ecommerce stores, increasing their sales and making it easier for customers to buy their favorite items. Think Amazon-style shopping, including the famous one-click checkout, but for a network of ecommerce merchants who previously could not compete with the frictionless shopping experience of Amazon.\nFounded in 2020, with a product launch in 2021, we're growing quickly and looking to expand our team.\nPeachPay has secured funding from a number of investors, including former founders in the ecommerce space, the company behind WordPress, and top venture capital firms.\nEngineering at PeachPay\nOur engineers work across the stack on a variety of projects. We look for people who are willing to learn new things daily, ask questions that guide our product direction, and take ownership of engineering projects from start to finish. Technologies we use include TypeScript, Node.js, and MongoDB, but it’s okay if you haven’t used these before. We believe that solid engineering fundamentals provide more value in the long run than trivia about current frameworks.\nRequirements\nAn appreciation for working in a fast-paced environment and building products from ground zero\nExperience being a generalist and working on both the frontend, backend, and doing anything it takes to solve problems and delight users both internally and externally\nA tendency to thrive in a collaborative environment involving different stakeholders and subject matter experts\nPride in working on projects to successful completion involving a wide variety of technologies and systems\nA knack for stitching together many different services and processes even if they have not worked with them before\nEmpathy for users and the ability to craft great experiences\nEnjoyment working with a diverse group of people with different areas of expertise\nThe ability to uphold best practices in engineering, security, and design\nBenefits\nAlthough we're still growing, we can offer some real perks that actually help your career.\nHave a big impact — know the results of your work right away. Whether it's a new marketing campaign, product feature, or partnership strategy, our feedback loop is short.\nLearn a lot — you will be expected to figure things out and take action.\nWork on your own schedule — some people work best at 3 in the morning, and that's okay.\nBe judged by your work, not fancy credentials.\nFor those in office: unlimited free food, and a PS5 for those who like gaming!"
    },
    {
      "company": "Udemy",
      "company_url": "https://www.linkedin.com/company/udemy?trk=public_jobs_topcard-org-name",
      "location": "San Francisco, CA",
      "details": "About Udemy\nUdemy is the world’s largest education platform with more than 30 million monthly visitors. Through our Consumer and Enterprise businesses, Udemy creates new possibilities for people and organizations everywhere by connecting them to the knowledge and skills they need to succeed in a changing world.\nThe Udemy consumer marketplace offers thousands of up-to-date courses in dozens of languages and provides the tools learners and instructors need to achieve their goals and reach their full potential.\nFor companies, Udemy Business (UB) offers an employee training and development platform with subscription access to thousands of courses, learning analytics, as well as the ability to host and distribute their own content. Our enterprise platform is among the fastest growing SaaS businesses in the world. UB has more than 10,000 customers and serves the majority of the Fortune 100.\nWe are proud to be recognized for our world class employee experience:\nBusiness Insider SF: Best Places to Work Bay Area\nBuilt In Colorado: Best Places to Work\nBest Workplaces (Great Place to Work List): #1 in Turkey\nCertified Best Place to Work: Dublin\nFortune: Change the World Company\nUdemy is headquartered in San Francisco with hubs in Ankara, Turkey; Austin, Texas; Boston, Massachusetts; Mountain View, California; Denver, Colorado; Dublin, Ireland; Melbourne, Australia; New Delhi, India; and Sao Paulo, Brazil.\nVaccine Mandate (US Only)\nUdemy is committed to keeping its employees, clients, and communities safe. Accordingly, we require all U.S. employees to be fully vaccinated against COVID-19 if their work requires them to come into a Udemy office or come into close contact with others. If you are unable to get vaccinated due to a medical condition, disability, sincerely-held religious belief, or as otherwise required by applicable law, we will consider requests for accommodation.\nInformation regarding data privacy is available within the Udemy Careers Privacy Notice .\nAbout The Role:\nUdemy is looking for a software engineer intern to join the Data Platform team for the summer. As a member of the team, you will be responsible for a variety of software development projects ranging from scaling the data infrastructure to setting up new internal data services/products to building and expanding frameworks that enable others to easily develop data pipelines. The ideal candidate is a motivated self-starter with a passion for building software that meaningfully improves the lives of people around the world!\nResponsibilities:\nBuild and integrate scalable backend systems, services, platforms, and tools\nCollaborate with data scientists and engineers to solve complex data problems at scale\nIdentify and evaluate new technologies that improve performance, maintainability and elegance of our infrastructure\nContribute to a team culture that values inclusiveness and quality while fostering innovation\nQualifications:\nStrong knowledge of computer science fundamentals, including object-oriented design, data structures, and algorithms\nProficient with a programming language, such as Python, Java, or Scala\nSelf-driven, highly motivated, and able to learn quickly\nExcellent written and oral communication skills\nIdeally graduating in 2022\nPreferred, but not required:\nFamiliarity with design and development of large-scale platforms and services\nFamiliarity with data processing frameworks and tools such as Spark, Hadoop, Hive, and Kafka\nFamiliarity with databases such as MySQL and Redshift\nFamiliarity with infrastructure as code tools such as Terraform, Ansible, and Packer\nFamiliarity with developing end-to-end data pipelines\nThe length of this internship will be between 7-13 weeks."
    },
    {
      "company": "Stripe",
      "company_url": "https://www.linkedin.com/company/stripe?trk=public_jobs_topcard-org-name",
      "location": "United States",
      "details": "We’re looking for a software engineer to join a new team focused on building world class internal documentation systems.\nStripe’s engineering org is scaling quickly. To support that growth we must implement thoughtful and flexible internal documentation systems and tools that enable engineers to write, find, and consume docs quickly and confidently. This team will lay the groundwork for how Stripe engineers get things done over the next ten years.\nYou Will\nSolve challenging product and infrastructure problems that enable our internal documentation to grow and scale with our engineering org\nDevelop a deep understanding of our internal users and how they get engineering work done\nBuild and improve the backend tools and systems that enable engineers to produce and maintain high-quality, accurate documentation cheaply and easily\nDesign and implement new tools and interfaces for writing and consuming technical documentation\nBuild and maintain a system that allows for fast search and discovery of existing documentation\nYou may be a fit for this role if you:\nHave a passion for developer productivity and great documentation\nHave 3+ years of Software Engineering experience\nHave hands-on experience building developer tools\nEnjoy working across the stack—on frontend, backend, infrastructure, or data pipelines—to solve complex problems and delight our users (you don’t need to be an expert in all of these, but it helps to be interested in learning about them)\nTake pride in shepherding projects from ideation to completion, often requiring partnership with stakeholder teams to carefully roll out changes\nSeek out feedback from your users and empathetically advocate for them throughout the development process\nWhat’s it like to work at Stripe?\nStripe is helping the internet fulfill its potential as a platform for economic progress by building software tools that accelerate global economic access and technological development. Stripe makes it easy to start, run, and scale an internet business from anywhere in the world. We look at Stripe as a constant work in progress and the same is true of our people; for all of us, we believe the best is yet to come. We’re here to support each other in our curiosity and creativity – which we pursue through thoughtful discussion and knowledge-sharing among a diverse set of peers and colleagues. We want to work in a company of warm, inclusive people who treat their colleagues exceptionally well. The kind of people who are committed to going out of their way to help other Stripes in the short-term and pushing them to improve over the long-term (by helping them to get better at what they do). We’re a highly cross-functional organization and view that as part of the fun: we design our space to encourage as much collaboration as possible. We have long tables in the kitchen for a reason (to enable everyone to meet new people and learn from them). We also have a culture of transparency that we carry through to email communication, ensuring that Stripes all around the world have the information they need to make good local decisions. In both our products and our people, we aim to reflect, represent and advocate for all of our users, globally. Our users transcend geography, culture and language; what we share, collectively, is a drive to create a fairer, more economically interconnected world."
    }
  ]
}
